ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
<?xml version="1.0" encoding="utf-8"?>
<openEspRadioPeripheralFragment id="WIFI_MAC">
    <peripheral>
      <name>WIFI_MAC_INTERNAL_TX_BLOCK_ACK</name>
      <description>SOURCE[BLOB_LIBPP_DBG_READ_INTERNAL_TXBA]; CONFIDENCE[instruction-exact]. Complete dbg_read_internal_txba reads one internal WDEVTXBA result: a 64-bit bitmap, two transmitter-address words and a combined fragment/starting-sequence/TID word.</description>
      <baseAddress>0x2010429c</baseAddress>
      <registers>
        <register><name>BITMAP_HIGH</name><addressOffset>0x00</addressOffset><size>32</size><access>read-only</access></register>
        <register><name>BITMAP_LOW</name><addressOffset>0x04</addressOffset><size>32</size><access>read-only</access></register>
        <register><name>TRANSMITTER_ADDRESS_WORD_0</name><description>First WDEVTXBA TA word printed by the complete blob decoder. Byte ordering is retained as a raw word until a matching live frame qualifies it.</description><addressOffset>0x08</addressOffset><size>32</size><access>read-only</access></register>
        <register><name>TRANSMITTER_ADDRESS_WORD_1</name><description>Second WDEVTXBA TA word printed by the complete blob decoder. Byte ordering is retained as a raw word until a matching live frame qualifies it.</description><addressOffset>0x0c</addressOffset><size>32</size><access>read-only</access></register>
        <register>
          <name>CONTROL_SEQUENCE</name>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>FRAGMENT_NUMBER</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>STARTING_SEQUENCE</name><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field><field><name>TID</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_COLOR_COLLISION</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RX_DEBUG_COUNTERS,HIL_OPEN_RX_STATISTICS_BASELINE_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Complete dbg_read_color_collision reads the 64-bit observed BSS-color bitmap. Its adjacent control word is the canonical WIFI_MAC_HE_INIT_PREFIX.RX_FIELD_CONTROL register. Open HE HIL observed color bit 25, threshold one and timeout 60 seconds.</description>
      <baseAddress>0x20104040</baseAddress>
      <registers>
        <register><name>BSS_COLOR_BITMAP_LOW</name><description>RX_HE_BSS_COLOR_MAPLO.</description><addressOffset>0x00</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>BSS_COLOR_BITMAP_HIGH</name><description>RX_HE_BSS_COLOR_MAPHI.</description><addressOffset>0x04</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_POWER_SAVE</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RX_MISC_DEBUG,BLOB_LIBPP_HAL_HE_BSSID_LIFECYCLE,HIL_OPEN_HE_BSSID_LIFECYCLE_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. WDEV_RX_POWER_SAVE_CONF decoded by complete dbg_read_rx_misc. Complete hal_he_set_power_save sets the interface-zero intra-PPDU and BSS-color-check bits as the tail of hal_he_bssid_init; open associated-STA HIL read both bits set.</description>
      <baseAddress>0x201040a0</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>RX_PS_THRESHOLD</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field><field><name>RX_PS_ENABLE</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>STOP_RF</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>PS_READY</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FE_FREQUENCY_HOP_TIME</name><bitOffset>13</bitOffset><bitWidth>8</bitWidth></field><field><name>MIDDLE_UNKNOWN</name><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field><field><name>RX_PHY_SIGNAL_DELAY</name><bitOffset>23</bitOffset><bitWidth>5</bitWidth></field><field><name>INTRA_PS_CHECK_BSS_COLOR_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_HE_BSSID_LIFECYCLE,BLOB_LIBPP_HAL_RX_MISC_DEBUG]; CONFIDENCE[instruction-exact]. Complete hal_he_set_power_save sets bit 28 for interface zero as the final fresh-read RMW of hal_he_bssid_init; dbg_read_rx_misc names it INTRA_PS_CHECK_BSS_COLOR.</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>INTRA_PPDU_PS_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_HE_BSSID_LIFECYCLE,BLOB_LIBPP_HAL_RX_MISC_DEBUG]; CONFIDENCE[instruction-exact]. Complete hal_he_set_power_save sets bit 29 for interface zero immediately before bit 28; dbg_read_rx_misc names it INTRA_PPDU_PS.</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>RX_VHT_TXOP_PS_CHECK_ADDRESS</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>RX_VHT_TXOP_PS_ENABLE</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_BSSID_LIST</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RX_MISC_DEBUG,BLOB_LIBPP_HAL_HE_INIT_PREFIX]; CONFIDENCE[instruction-exact]. Canonical WDEVRXCTR_BSSIDLIST word. Complete dbg_read_rx_misc names bits 19:18 RXCTL9_BSSID_POS; the HE init prefix independently writes encoding two to that same field.</description>
      <baseAddress>0x20104110</baseAddress>
      <registers>
        <register><name>CONTROL</name><addressOffset>0x00</addressOffset><size>32</size><access>read-write</access><fields><field><name>LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>18</bitWidth></field><field><name>RX_CONTROL_9_BSSID_POSITION</name><description>SOURCE[BLOB_LIBPP_HAL_RX_MISC_DEBUG,BLOB_LIBPP_HAL_HE_INIT_PREFIX]; CONFIDENCE[instruction-exact]. Debug-decoded BSSID position field; complete hal_he_init writes encoding two.</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>12</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_CUSTOM_TYPE</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RX_MISC_DEBUG]; CONFIDENCE[instruction-exact]. WDEVTXRX_TAB three custom frame-type match and ACK-index profiles decoded by complete dbg_read_rx_misc.</description>
      <baseAddress>0x20104ca4</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>TYPE_2_ACK_INDEX</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>TYPE_2_VALUE</name><bitOffset>3</bitOffset><bitWidth>6</bitWidth></field><field><name>TYPE_2_ENABLE</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TYPE_1_ACK_INDEX</name><bitOffset>10</bitOffset><bitWidth>3</bitWidth></field><field><name>TYPE_1_VALUE</name><bitOffset>13</bitOffset><bitWidth>6</bitWidth></field><field><name>TYPE_1_ENABLE</name><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>TYPE_0_ACK_INDEX</name><bitOffset>20</bitOffset><bitWidth>3</bitWidth></field><field><name>TYPE_0_VALUE</name><bitOffset>23</bitOffset><bitWidth>6</bitWidth></field><field><name>TYPE_0_ENABLE</name><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>30</bitOffset><bitWidth>2</bitWidth></field></fields>
        </register>
