ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_STATISTICS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RX_DEBUG_COUNTERS,HIL_OPEN_RX_STATISTICS_BASELINE_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Sparse RX hardware statistics decoded by complete dbg_read_rx_count. Ten-bit and sixteen-bit masks, the signed CFO transform and every register address below follow the complete instruction body and its pinned format string. Open HE HIL observed coherent MPDU/end/data, CFO, FCS, power-drop, HT-SIG, HE-SIG-A and interrupt counts while all buffer/FIFO/TKIP counters remained zero.</description>
      <baseAddress>0x2010430c</baseAddress>
      <registers>
        <register><name>MPDU_AND_CFO</name><description>WDEVRX_MPDU in bits 15:0. The blob sign-extends bits 31:16 and multiplies by 40 to print WDEVRX_CFO.</description><addressOffset>0x00</addressOffset><size>32</size><access>read-only</access><fields><field><name>MPDU_COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>CFO_ACCUMULATOR</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>BRX_ERROR_AGC</name><addressOffset>0x04</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>BRX_ERROR</name><addressOffset>0x08</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR</name><addressOffset>0x0c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_ABORT</name><addressOffset>0x10</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_AGC_EXIT</name><addressOffset>0x14</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_BASEBAND_OFF</name><addressOffset>0x18</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_FDM_WATCHDOG</name><addressOffset>0x1c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_POWER_DROP</name><addressOffset>0x20</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_RESTART</name><addressOffset>0x24</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_SERVICE</name><addressOffset>0x28</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_TX_OVER</name><addressOffset>0x2c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_HE_UNSUPPORTED</name><addressOffset>0x30</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_HE_SIG_A_CRC</name><addressOffset>0x34</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_HE_FORMAT</name><addressOffset>0x38</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_HE_SIG_B_ERROR</name><addressOffset>0x3c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>NRX_HT_SIG_ERROR</name><addressOffset>0x40</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_UNSUPPORTED</name><addressOffset>0x44</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>SIGNAL_FIELD</name><description>WDEVRX_SF.</description><addressOffset>0x50</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>ABORT</name><addressOffset>0x54</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>FCS_PASS_COUNT</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>FCS_ERROR</name><addressOffset>0x58</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>FIFO_OVERFLOW</name><addressOffset>0x5c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>BUFFER_FULL</name><addressOffset>0x60</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>OTHER_UNICAST</name><addressOffset>0x64</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>TKIP_ERROR</name><addressOffset>0x68</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>SAME_BM_ERROR</name><addressOffset>0x6c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>ACK_INTERRUPT</name><addressOffset>0x70</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>RTS_INTERRUPT</name><addressOffset>0x74</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>CTS_INTERRUPT</name><description>SOURCE[BLOB_LIBPP_PP_DEBUG_HW_STATISTICS]; CONFIDENCE[instruction-exact]. Complete dbg_lmac_hw_statis_dump prints the full word at 0x20104384 as cts_int. Its internal field width is not inferred.</description><addressOffset>0x78</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DATA_SUCCESS</name><addressOffset>0x7c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>END</name><addressOffset>0x80</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>BT_BLOCK_ERROR</name><addressOffset>0x84</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>FREQUENCY_HOP_ERROR</name><addressOffset>0x88</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>LAST_UNMATCHED_ERROR</name><addressOffset>0x8c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>TRIGGER</name><description>SOURCE[BLOB_LIBPP_PP_DEBUG_HW_STATISTICS]; CONFIDENCE[instruction-exact]. Complete dbg_lmac_hw_statis_dump prints the full word at 0x2010439c as trigger. This is a separate hardware-statistics observation from the decoded HE Trigger RX counter at 0x20104dbc.</description><addressOffset>0x90</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TX_STATISTICS</name>
      <description>SOURCE[BLOB_LIBPP_PP_DEBUG_HW_STATISTICS]; CONFIDENCE[instruction-exact]. Complete libpp.a[pp_debug.o]::dbg_lmac_hw_statis_dump reads these four consecutive words and prints them as txrts, txcts, track and trcts. It then reads the already canonical RX_TX_HANG/PANIC words at 0x20104e18/1c under its shorter txhung/panic labels. The blob applies no masks; the SVD therefore preserves each word without inventing subfields.</description>
      <baseAddress>0x20104e08</baseAddress>
      <registers>
        <register><name>TX_RTS</name><addressOffset>0x00</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>TX_CTS</name><addressOffset>0x04</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>TRACK</name><addressOffset>0x08</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>TRCTS</name><description>The abbreviated blob label is retained verbatim; its expansion is not yet proven.</description><addressOffset>0x0c</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_DIAGNOSTIC_STATISTICS</name>
      <description>SOURCE[BLOB_LIBPP_PP_DEBUG_DIAGNOSTIC_STATISTICS]; CONFIDENCE[instruction-exact]. Complete libpp.a[pp_debug.o]::dbg_lmac_diag_statis_dump ties the blob's diag0 through diag12 and diagsel labels to these sparse MMIO words. The non-contiguous geometry and absence of diag11 are properties of the complete body. Higher-level meanings and internal bit widths remain unknown.</description>
      <baseAddress>0x201043b4</baseAddress>
      <registers>
        <register><name>DIAG4</name><addressOffset>0x0000</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG5</name><addressOffset>0x0004</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG6</name><addressOffset>0x0008</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG7</name><addressOffset>0x000c</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG8</name><addressOffset>0x012c</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG9</name><addressOffset>0x0130</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG10</name><addressOffset>0x0134</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG12</name><addressOffset>0x0138</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG0</name><addressOffset>0x0a9c</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG1</name><addressOffset>0x0aa0</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG2</name><addressOffset>0x0aa4</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG3</name><addressOffset>0x0aac</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG_SELECT</name><addressOffset>0x0ab0</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_HANG_STATISTICS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RX_DEBUG_COUNTERS,HIL_OPEN_RX_STATISTICS_BASELINE_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Complete dbg_read_rx_count decodes two eight-bit hang counters and two full-width combined hang/panic counters. All four remained zero during the connected open HE matrix baseline.</description>
      <baseAddress>0x20104c64</baseAddress>
      <registers>
        <register><name>HANG</name><addressOffset>0x00</addressOffset><size>32</size><access>read-only</access><fields><field><name>LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>TX_COUNT</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>RX_COUNT</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register>
        <register><name>RX_TX_HANG</name><description>Complete dbg_read_rx_count names the combined counter RX_TX_HANG; complete pp_debug.o::dbg_lmac_hw_statis_dump independently reads the same full word under the shorter txhung label.</description><addressOffset>0x1b4</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>RX_TX_PANIC</name><description>Complete dbg_read_rx_count names the combined counter RX_TX_PANIC; complete pp_debug.o::dbg_lmac_hw_statis_dump independently reads the same full word under the shorter panic label.</description><addressOffset>0x1b8</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_STA_BEACON_FILTER</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. Station beacon-filter control word recovered from the complete enable and disable leaves. The three low bits are toggled together; individual hardware meanings remain unknown.</description>
      <baseAddress>0x201042b4</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. hal_enable_sta_beacon_filter sets bits 2:0 after enabling the matching interrupt; hal_disable_sta_beacon_filter clears them before disabling that interrupt.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>ENABLES_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field></fields>
        </register>
