ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_INTERFACE_ADDRESS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_MAC_SET_ADDR,BLOB_LIBPP_RX_POLICY]; CONFIDENCE[instruction-exact-hil-qualified]. Four interface-address pairs consumed by MAC receive filtering.</description>
      <baseAddress>0x2010405c</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x8</dimIncrement><dimIndex>0-3</dimIndex><name>ADDRESS_LOW%s</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_SET_ADDR]; CONFIDENCE[instruction-exact]. Interface MAC bytes 0..3 in little-endian order, published by the first full-word store.</description><addressOffset>0x00</addressOffset><size>32</size><access>read-write</access><fields><field><name>BYTES_0_3</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><dim>4</dim><dimIncrement>0x8</dimIncrement><dimIndex>0-3</dimIndex>
          <name>ADDRESS_HIGH%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_SET_ADDR,BLOB_LIBPP_RX_POLICY]; CONFIDENCE[instruction-exact-partial]. Interface MAC bytes 4..5 are published as a full-word store before a separate fresh-read RMW sets receive-policy enable bit 16.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>BYTES_4_5</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>RX_POLICY_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_SET_ADDR,BLOB_LIBPP_RX_POLICY,BLOB_LIBNET80211_WIFI_RX_POLICY]; CONFIDENCE[instruction-exact-partial]. Set by a separate fresh-read RMW in hal_mac_set_addr and by the reachable associated-STA policy branch.</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>POLICY_HIGH_UNKNOWN</name><bitOffset>17</bitOffset><bitWidth>15</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_FILTER</name>
      <description>SOURCE[BLOB_LIBPP_HAL_INIT_RX_POLICY,BLOB_LIBPP_RX_POLICY,BLOB_LIBNET80211_WIFI_RX_POLICY,BLOB_LIBPP_HAL_SNIFFER_ENABLE,BLOB_LIBPP_HAL_RX_MISC_DEBUG]; CONFIDENCE[instruction-exact-hil-qualified]. Four WDEVRX_ABORT receive-queue policy words. Complete dbg_read_rx_misc names every used bit through 19; queue three is also the complete promiscuous-sniffer control word.</description>
      <baseAddress>0x201040d8</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-3</dimIndex>
          <name>POLICY%s</name>
          <description>SOURCE[BLOB_LIBPP_RX_POLICY,BLOB_LIBPP_HAL_RX_MISC_DEBUG]; CONFIDENCE[instruction-exact]. WDEVRX_ABORT[0-3], updated through separate fresh-read RMW edges.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>DUMP_UNICAST_CHECK_DA</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DUMP_UNICAST_CHECK_BSSID</name><description>SOURCE[BLOB_LIBPP_RX_POLICY,BLOB_LIBNET80211_WIFI_RX_POLICY,HIL_VENDOR_STA_AUTH_POLICY_2026_07_28]; CONFIDENCE[instruction-exact-hil-qualified]. The policy-six UBSSID branch sets this bit before live vendor Authentication.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DUMP_BROADCAST_CHECK_BSSID</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ABORT_GROUP</name><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PASS_BEACON</name><description>SOURCE[BLOB_LIBPP_RX_POLICY]; CONFIDENCE[instruction-exact].</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>POLICY_BIT_5_UNKNOWN</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DUMP_MANAGEMENT_NOT_CHECK_BSSID</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RECEIVE_BROADCAST_CHECK_BSSID</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RECEIVE_UNICAST_CHECK_BSSID</name><description>SOURCE[BLOB_LIBPP_RX_POLICY,BLOB_LIBNET80211_WIFI_RX_POLICY,HIL_VENDOR_STA_AUTH_POLICY_2026_07_28]; CONFIDENCE[instruction-exact-hil-qualified]. The policy-six UBSSID branch sets this bit before live vendor Authentication.</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RECEIVE_UNICAST_CHECK_DA</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RECEIVE_MANAGEMENT_NOT_CHECK_BSSID</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TO_DS</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FROM_DS</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CHECK_BSSID</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CHECK_DA</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CHECK_BROADCAST_BSSID</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>NOT_GROUP</name><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AUTO_ACK_DISABLE</name><description>SOURCE[BLOB_LIBPP_HAL_SNIFFER_ENABLE,BLOB_LIBPP_HAL_RX_MISC_DEBUG]; CONFIDENCE[instruction-exact]. Complete hal_sniffer_enable sets this bit first on queue three; the debug decoder names it AUTOACK_DISABLE.</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SECURITY_ERROR_DISABLE</name><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SECURITY_TKIP_ERROR_FORCE_ON</name><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HIGH_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>12</bitWidth></field>
          </fields>
        </register>
        <register><dim>3</dim><dimIncrement>0x04</dimIncrement><dimIndex>0-2</dimIndex>
          <name>BASEBAND_ERROR_STATUS%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. First three words sampled by the bounded four-entry hal_ifc_get_bb_err_bitmap loop. Bit 16 contributes the corresponding output bitmap bit.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>ERROR</name><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>MISC_PACKET_POLICY</name>
          <description>SOURCE[OPEN_DRIVER_PROMISCUOUS_RX_FRONTIER,BLOB_LIBPP_HAL_SNIFFER_MISC,BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-hil-qualified]. The open promiscuous RX frontier sets bits 15:8 together after the complete sniffer-enable leaf. The complete vendor misc-packet leaf independently proves this register and related packet-class fields. Complete hal_ifc_get_bb_err_bitmap reads bit 16 as the fourth baseband-error status bit.</description>
          <addressOffset>0x1c</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>OPEN_MISC_PACKET_CLASSES</name><description>SOURCE[OPEN_DRIVER_PROMISCUOUS_RX_FRONTIER]; CONFIDENCE[hil-observed]. Eight class-enable bits set together by the working open scan/STA receive path.</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>

            <field><name>BASEBAND_ERROR</name><description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. Fourth status bit sampled by the bounded hal_ifc_get_bb_err_bitmap loop.</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field>

          </fields>
        </register>
