ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_KEY_TABLE</name>
      <description>
        SOURCE[BLOB_LIBPP_HAL_CRYPTO];
        CONFIDENCE[instruction-exact-hil-qualified].
        Twenty-five entries of ten 32-bit words. Complete
        hal_crypto_clr_key_entry proves the 0x28-byte stride and all ten
        ordered stores; set/get leaves prove the peer/control/key layout.
      </description>
      <baseAddress>0x20105800</baseAddress>
      <registers>
        <register>
          <dim>250</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-249</dimIndex>
          <name>ENTRY_WORD%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_CRYPTO]; CONFIDENCE[instruction-exact-partial]. Flat key-table word; entry is index/10 and word is index%10. Words zero and one carry peer/control, later words carry key material for the recovered CCMP transaction.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TX_COMMON</name>
      <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBPP_HAL_TX_TRIGGER_FLOW,MIGRATION_LMAC_TX,ROM_REV0_PHY_CCA_CONTROL]; CONFIDENCE[instruction-exact-hil-qualified]. Shared Wi-Fi CCA, timeout and completion state used by MAC transmit queues and the PHY-owned Wi-Fi CCA gate.</description>
      <baseAddress>0x20104c5c</baseAddress>
      <registers>
        <register>
          <name>CCA_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,ROM_REV0_PHY_CCA_CONTROL]; CONFIDENCE[instruction-exact]. Global Wi-Fi TX CCA control; complete PHY enable/disable leaves update the high two fields through separate fresh reads.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>CONTROL_LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>28</bitWidth></field>
            <field><name>PHY_AUX_FORCE</name><description>SOURCE[ROM_REV0_PHY_CCA_CONTROL]; CONFIDENCE[instruction-exact]. Complete phy_disable_cca writes encoding two and complete phy_enable_cca writes zero in their second fresh-read edge.</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint></field>
            <field><name>FORCE</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,MIGRATION_LMAC_TX,ROM_REV0_PHY_CCA_CONTROL]; CONFIDENCE[instruction-exact]. Value three suppresses CCA while invalidating a timed-out queue. Complete phy_disable_cca writes encoding two and complete phy_enable_cca writes zero.</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint></field>
          </fields>
        </register>
        <register>
          <name>QUEUE_STATE_CLEAR</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX]; CONFIDENCE[instruction-exact]. Queue collision/timeout state acknowledgement.</description>
          <addressOffset>0x54</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>EVENTS</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>QUEUE_STATE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBPP_HAL_TX_TRIGGER_FLOW,MIGRATION_LMAC_TX]; CONFIDENCE[instruction-exact-partial]. Per-queue timeout and trigger-flow state. The complete trigger-flow HAL getter returns the entire high byte; the complete completion dispatcher then right-shifts it by the completed queue number and tests bit zero.</description>
          <addressOffset>0x58</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>LOW_STATE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>TIMEOUT</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX]; CONFIDENCE[instruction-exact]. Bits 16..19 correspond to ordinary queues 0..3.</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>MIDDLE_STATE_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TRIGGER_FLOW</name><description>SOURCE[BLOB_LIBPP_HAL_TX_TRIGGER_FLOW,MIGRATION_LMAC_TX]; CONFIDENCE[instruction-exact]. Complete hal_mac_get_txq_in_trig_flow_state returns bits 31:24 as an eight-bit queue bitmap. Complete lmacProcessTxComplete shifts that bitmap by the completed queue index and tests bit zero; its bounded dispatcher proves queue bits zero through four. The meaning of the remaining physically returned bits is not narrowed beyond queue-state bitmap.</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>COMPLETE_CLEAR</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,MIGRATION_LMAC_TX]; CONFIDENCE[instruction-exact]. Preserved-image acknowledgement for ordinary queue completion bits.</description>
          <addressOffset>0x5c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>STATE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>COMPLETE_STATE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,MIGRATION_LMAC_TX]; CONFIDENCE[instruction-exact]. Low four bits report completed ordinary queues 0..3.</description>
          <addressOffset>0x60</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>ORDINARY_QUEUES</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TX_QUEUE_CONTROL</name>
      <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,MIGRATION_LMAC_TX]; CONFIDENCE[instruction-exact-hil-qualified]. Four ascending physical banks represent logical EDCA queues 3,2,1,0.</description>
      <baseAddress>0x20104d34</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x10</dimIncrement><dimIndex>0-3</dimIndex>
          <name>PROTECTION%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBPP_TRC_AMPDU_PARAM,BLOB_LIBPP_HE_DELIMITER_SPACING,BLOB_LIBPP_HAL_HE_MU_EDCA_DEBUG,BLOB_LIBPP_HAL_HE_INIT_SUFFIX,HIL_VENDOR_ACTIVE_HT_VECTOR_2026_07_29,HIL_OPEN_HE20_MCS9_EMPTY_DELIMITERS_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Canonical WDEVTXQ_CONF2. Complete dbg_read_txq_conf2 names the three ten-bit lanes TXQ_MIN_MPDU_LEN for CBW20, CBW40 and CBW80, followed by SW_RTS and SW_CTS. For HT, complete mac_tx_set_htsig copies peer state offset 0x82 into all three lanes; complete rcUpdateAMPDUParam derives that value from the HT A-MPDU minimum MPDU start-spacing code. For HE, complete ppCalDeliNum stores the rate/GI/DCM/density-specific minimum subframe byte count at descriptor offset 0x28 and complete mac_tx_set_hesig copies that halfword into all three lanes. The HE init suffix clears the same SW_RTS/SW_CTS pair, not an independent register. A coherent hardware-owned vendor HT queue contained 0x0280a028, exactly three copies of negotiated value 40. Open HE20 MCS9 HIL with 16-us density proved value 230: fixed snapshot 0x31 lost all 32 MPDUs, while three copies of 230 received a full first-attempt BlockAck with 43 empty delimiters per non-final subframe. The descriptor-count RMWs target the separate queue-vector word at 0x20105504-q*0x7c.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>MINIMUM_MPDU_LENGTH_CBW20</name><description>First copy of the HT peer-derived or HE rate/density-derived minimum MPDU/subframe value.</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            <field><name>MINIMUM_MPDU_LENGTH_CBW40</name><description>Second copy of the HT peer-derived or HE rate/density-derived minimum MPDU/subframe value.</description><bitOffset>10</bitOffset><bitWidth>10</bitWidth></field>
            <field><name>MINIMUM_MPDU_LENGTH_CBW80</name><description>Third copy of the HT peer-derived or HE rate/density-derived minimum MPDU/subframe value.</description><bitOffset>20</bitOffset><bitWidth>10</bitWidth></field>
            <field><name>SOFTWARE_RTS</name><description>SOURCE[BLOB_LIBPP_HAL_HE_MU_EDCA_DEBUG]; CONFIDENCE[instruction-exact]. Complete dbg_read_txq_conf2 names bit 30 SW_RTS.</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SOFTWARE_CTS</name><description>SOURCE[BLOB_LIBPP_HAL_HE_MU_EDCA_DEBUG]; CONFIDENCE[instruction-exact]. Complete dbg_read_txq_conf2 names bit 31 SW_CTS.</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x10</dimIncrement><dimIndex>0-3</dimIndex>
          <name>CONFIG%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBCOEX_PTI_TABLE,HIL_OPEN_AUTH_PTI_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Timeout, contention window, interface, AIFSN and scheduler-priority fields configured as distinct recovered RMW edges. Scheduler priority is not the original packet PTI retained in the vector bank.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TIMEOUT</name><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            <field><name>CONTENTION_WINDOW</name><bitOffset>12</bitOffset><bitWidth>10</bitWidth></field>
            <field><name>INTERFACE</name><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>AIFSN</name><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>SCHEDULER_PRIORITY</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBCOEX_PTI_TABLE,HIL_OPEN_AUTH_PTI_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Complete mac_tx_set_pti writes the unsigned minimum of packet PTI and coexistence event-one PTI here. This scheduler value is independent of the four original packet-PTI lanes in the vector bank; for Authentication and Association both values resolve to one. Open HIL read scheduler one in five reset-to-connect repetitions.</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field>
          </fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x10</dimIncrement><dimIndex>0-3</dimIndex>
          <name>CONTROL%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,MIGRATION_LMAC_TX,HIL_OPEN_RX_LIVE_APPEND_2026_07_27,HIL_VENDOR_HT20_MCS0_SINGLE_PPDU_2026_07_29,HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29,HIL_OPEN_HE20_MCS0_DCM_SMPDU_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Descriptor address and PLCP0 format image in low 30 bits; VALID bit 30 and ENABLE bit 31 publish hardware ownership.</description>
          <addressOffset>0x0c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>DESCRIPTOR_ADDRESS_LOW</name><description>SOURCE[MIGRATION_LMAC_TX]; CONFIDENCE[instruction-exact]. Low twenty bits of the owned TX descriptor address; the DMA window supplies the high address bits.</description><bitOffset>0</bitOffset><bitWidth>20</bitWidth></field>
            <field><name>CONTROL_21_20_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX]; CONFIDENCE[instruction-exact-semantics-unknown]. Recovered PLCP0 control image; mac_tx_set_plcp0 initializes these two bits to binary 10 for the ordinary direct legacy path.</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>TXOP_DESCRIPTOR_CLASS_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX]; CONFIDENCE[instruction-exact-hil-qualified]. Complete pp.o ppTxFragmentProc reaches its common legacy setup at offsets 0x8e..0xa8 from the CCMP selector-three branch at 0x22a and sets descriptor bit seven. Complete hal_mac_tx.o mac_tx_set_txop_q offsets 0x86..0xaa then sets this queue-control bit exactly when descriptor flag bits 7:6 equal binary 10 and clears it otherwise. Thus the bounded ordinary individual/group CCMP path sets this bit after mac_tx_set_plcp0. A 2026-07-29 open HIL A/B clearing the bit increased raw ACK timeouts from the prior roughly 28 percent to 1395/2325 attempts (60 percent), so the exact set mapping is retained while the electrical meaning remains unknown.</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CONTROL_23_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX]; CONFIDENCE[instruction-exact-semantics-unknown]. Recovered PLCP0 control image; mac_tx_set_plcp0 initializes this bit to zero for the ordinary direct legacy path.</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PLCP_FORMAT</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,MIGRATION_LMAC_TX,HIL_OPEN_RX_LIVE_APPEND_2026_07_27,HIL_OPEN_AUTH_PLCP_FORMAT_2026_07_28,HIL_VENDOR_HT20_MCS0_SINGLE_PPDU_2026_07_29,HIL_OPEN_HT_SINGLE_EXTREMES_2026_07_29,HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29,HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29,HIL_OPEN_HE20_MCS0_DCM_SMPDU_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Three-bit format selector derived by complete mac_tx_set_plcp0 from vendor descriptor flags. For the bounded plain legacy roots, ppTxProtoProc maps the address-one I/G bit to descriptor flag 0x2: group traffic retains format zero, while an ordinary individual-address descriptor with zero flags selects format one. Exact vendor callback images select format one for both non-A-MPDU HT20 MCS0 and HE20 MCS0 DCM S-MPDU frames; the owned open paths receive ACK at the same format. Independently captured HT and HE A-MPDU images select aggregate format two or five respectively. Format three has an instruction-exact descriptor branch but its higher-level meaning remains open. A legacy-only single-variable A/B temporarily correlated format one with status five and format zero with one authentication response, but format-zero repetitions failed; that experiment is retained as evidence that completion status alone is not a protocol-success oracle, not as an override of the complete blob mapping.</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>CONTROL_29_27_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX]; CONFIDENCE[instruction-exact-semantics-unknown]. Remaining low control bits before ownership publication.</description><bitOffset>27</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>VALID</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ENABLE</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
