ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TX_QUEUE_VECTOR</name>
      <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBPP_HAL_HE_TX,BLOB_LIBPP_MAC_TX_SET_TB,ROM_REV0_MAC_TX_SET_TB,MIGRATION_LMAC_TX,HIL_VENDOR_HE20_MCS9_SU_2026_07_29,HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29,HIL_OPEN_HE20_MCS9_AMPDU_2026_07_29,HIL_OPEN_HE20_MCS0_DCM_SMPDU_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Four 0x7c-byte physical vector banks represent logical EDCA queues 3,2,1,0. The write-side Trigger-based path additionally publishes the tail of its linked MPDU-length list in the word between HE-SIG-A2 and POWER.</description>
      <baseAddress>0x20105364</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex><name>PLCP1%s</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBPP_DBG_READ_KEY_ENTRY,HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Per-queue second PLCP/vector word. Complete dbg_read_key_entry independently names bits 22:17 as KEY_ENTRY_INDEX and bits 24:23 as BSSID_SELECT. Complete mac_tx_set_plcp1 sets bit 29 for the guarded HT branch when descriptor word1 bit 15 selects 40-MHz channel width; the same selector is copied into HT-SIG1 CBW. A synchronous vendor raw HE20 MCS0 DCM capture used descriptor rate 0x1a and published 0x0401a000, proving that explicit DCM retains the ordinary 0x1a+MCS HE descriptor-code domain.</description><addressOffset>0x00</addressOffset><size>32</size><access>read-write</access><fields><field><name>LOW_MODE_DEPENDENT</name><bitOffset>0</bitOffset><bitWidth>17</bitWidth></field><field><name>KEY_ENTRY_INDEX</name><bitOffset>17</bitOffset><bitWidth>6</bitWidth></field><field><name>BSSID_SELECT</name><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field><field><name>HIGH_MODE_DEPENDENT</name><bitOffset>25</bitOffset><bitWidth>7</bitWidth></field></fields></register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex><name>HE_RTS_CONTROL%s</name><description>SOURCE[BLOB_LIBNET80211_IEEE80211_PARSE_HEOPR,MIGRATION_HE20_PEER]; CONFIDENCE[instruction-exact-partial]. Complete HE Operation peer programming sets bit 17 in all four physical queue vectors when the encoded RTS threshold is disabled.</description><addressOffset>0x04</addressOffset><size>32</size><access>read-write</access><fields><field><name>HE_RTS_DISABLED</name><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field></fields></register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex><name>PTI%s</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBCOEX_PTI_TABLE,HIL_OPEN_AUTH_PTI_2026_07_29,HIL_OPEN_HT_AMPDU_32_RETRY_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Complete mac_tx_set_pti publishes the original packet PTI independently into four lanes, then loads descriptor byte offset 0x22 once and passes it as argument six to hal_set_tx_pti, which publishes it as COUNT bits 31:20. This count is independent of the A-MPDU descriptor count written by mac_tx_set_mplen to HT_DESCRIPTOR_COUNTS. For vendor Authentication and Association, ieee80211_set_tx_pti event six maps through coex_pti_tab to packet PTI one; the independent scheduler field also resolves to one through the unsigned-minimum clamp against event-one PTI five. Vendor and open HIL both used 0x00111110, including the hardware-qualified 32-MPDU open profile.</description><addressOffset>0x08</addressOffset><size>32</size><access>read-write</access><fields><field><name>LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>PTI_0</name><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>PTI_1</name><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>PTI_2</name><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>PTI_3</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>COUNT</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,HIL_OPEN_HT_AMPDU_32_RETRY_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Descriptor metadata byte 0x22 passed to hal_set_tx_pti; not the A-MPDU MPDU/descriptor count.</description><bitOffset>20</bitOffset><bitWidth>12</bitWidth></field></fields></register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex><name>HE_CONTROL%s</name><description>SOURCE[BLOB_LIBPP_HAL_HE_TX,BLOB_LIBNET80211_HE_CONTROL_TX]; CONFIDENCE[instruction-exact]. Per-queue four-byte HT-Control/HE-Control image at 0x201054e4-logical_queue*0x7c. Complete hal_he_get_htc reads the whole word. Complete hal_he_set_htc writes the supplied word before independently selecting whether this software image overrides the hardware-generated HE-Control value.</description><addressOffset>0x0c</addressOffset><size>32</size><access>read-write</access><fields><field><name>IMAGE</name><description>Complete four-byte HE-Control image. Its A-Control subfields depend on the control ID; keep the finite protocol interpretation in the handwritten IEEE 802.11 layer rather than exposing overlapping mode-dependent SVD fields.</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex>
          <name>HT_SIGNAL%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBPP_DBG_READ_TX_SIG,IEEE80211_HT_SIG,HIL_VENDOR_HT20_MCS0_SINGLE_PPDU_2026_07_29,HIL_VENDOR_HT_AMPDU_PPDU,HIL_OPEN_HT_SINGLE_EXTREMES_2026_07_29,HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29]; CONFIDENCE[instruction-exact]. Complete libpp.a[hal_mac_tx.o]::mac_tx_set_htsig (size 0x23c) writes the packed HT-SIG1/HT-SIG2 queue image here for non-HE rates 16..35. Complete dbg_read_tx_sig independently prints the low MCS nibble and sixteen-bit length. The formatter copies descriptor word1 bit 15 to HT-SIG1 bit 7, whose standard meaning is CBW: zero selects 20 MHz and one selects 40 MHz. The exact vendor single-MPDU HT20 MCS0 callback image carried HT_SIGNAL=0x07006e00 for length 0x6e, confirming MCS zero, CBW20 and aggregate bit zero. Open HIL qualified the same single formatter at HT20 MCS0 LGI and HT40 MCS7 SGI. The independent two-MPDU HT20 MCS7/SGI capture carried 0x8f0c2e07 for aggregate length 0x0c2e, confirming aggregate bit one. The open direct-DMA A-MPDU path then received complete BlockAck for four separate HT40 MCS7/SGI two-MPDU submissions.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>MCS_LOW_NIBBLE</name><description>Low four bits printed as MCS by complete dbg_read_tx_sig. The open 1T1R path currently uses MCS0 through MCS7.</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>LOW_CONTROL_UNKNOWN</name><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>LENGTH</name><description>Sixteen-bit HT length printed by complete dbg_read_tx_sig.</description><bitOffset>8</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>HIGH_CONTROL_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
