ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex>
          <name>VHT_SIGNAL_1%s</name>
          <description>SOURCE[BLOB_LIBPP_DBG_READ_TX_SIG]; CONFIDENCE[instruction-exact]. Complete dbg_read_tx_sig decodes this word only when PLCP_FORMAT is three and names VHT MCS, channel width, group ID, NSTS, SU partial AID, SGI, SGI symbol disambiguation and coding. This maps an internal hardware vector; it does not assert that the ESP32-S31 public Wi-Fi mode supports VHT transmission.</description>
          <addressOffset>0x14</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>CHANNEL_WIDTH</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>UNKNOWN_2_3</name><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>GROUP_ID</name><bitOffset>4</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>NSTS</name><bitOffset>10</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>SU_PARTIAL_AID</name><bitOffset>13</bitOffset><bitWidth>9</bitWidth></field>
            <field><name>UNKNOWN_22_23</name><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>SHORT_GI</name><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SHORT_GI_SYMBOL_DISAMBIGUATION</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CODING</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>UNKNOWN_27</name><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MCS</name><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field>
          </fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex>
          <name>VHT_MODE%s</name>
          <description>SOURCE[BLOB_LIBPP_DBG_READ_TX_SIG]; CONFIDENCE[instruction-exact]. Complete dbg_read_tx_sig decodes this word only when PLCP_FORMAT is three and names bits 18:2 SU_CBW20_PRE_EOFPAD_UNIT4BYTES_LEN. Remaining bits are not assigned a meaning by the complete body.</description>
          <addressOffset>0x18</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>SU_CBW20_PRE_EOFPAD_UNIT4BYTES_LENGTH</name><bitOffset>2</bitOffset><bitWidth>17</bitWidth></field>
            <field><name>HIGH_UNKNOWN</name><bitOffset>19</bitOffset><bitWidth>13</bitWidth></field>
          </fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex>
          <name>HE_SU_SIGNAL_A1%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_TX,HIL_VENDOR_HE20_MCS9_SU_2026_07_29,HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29,HIL_OPEN_HE20_MCS9_AMPDU_2026_07_29,ESP_WIFI_SYS_S31_HE_SU_SIG]; CONFIDENCE[instruction-exact-hil-qualified]. Complete mac_tx_set_hesig writes this HE SU vector word at 0x201054f4-q*0x7c. Live vendor MCS9 uplink images 0xfc205b4f and 0xfc605b4f independently qualify MCS nine, BSS color 27, HE20 and GI/LTF selectors one and three. A separate explicit MCS0 DCM vendor frame published 0xfc204087. Replaying the selector-one MCS9 image through the owned open DMA path received a complete 32-MPDU BlockAck on the first attempt and remained stable for more than 13,800 aggregates. Bits 31:26 are a TX-vector-required all-ones image and are not presented as on-air HE-SIG-A1 payload bits.</description>
          <addressOffset>0x1c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>FORMAT</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BEAM_CHANGE</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>UPLINK</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MCS</name><bitOffset>3</bitOffset><bitWidth>4</bitWidth></field>
            <field>
              <name>DCM</name>
              <description>SOURCE[BLOB_LIBPP_HAL_HE_TX,BLOB_LIBPP_HE_DCM,BLOB_LIBNET80211_RAW_TX_RATE_CONFIG,HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29,HIL_OPEN_HE20_MCS0_DCM_SMPDU_2026_07_29,HIL_OPEN_HE20_MCS0_DCM_AMPDU_2026_07_29,IEEE80211_HE_PHY_CAP_DCM]; CONFIDENCE[instruction-exact-hil-qualified]. Complete mac_tx_set_hesig copies descriptor-state word at offset 0x30 bit 15 into HE-SIG-A1 bit 7. Complete rcGetDCMMaxRate bounds the ordinary BCC DCM rate family to MCS0, MCS1 and MCS3 according to the peer DCM receive constellation. The vendor raw-TX configuration path independently set descriptor byte +0x31 bit 7 while retaining descriptor rate 0x1a, and the live formatter published HE-SIG-A1 0xfc204087. The owned open S-MPDU path reproduced that word and received an ordinary ACK with completion status zero. Rate-bounded open A-MPDUs with 30, 29 and 26 MPDUs then received BlockAck at MCS0 for the three qualified GI/LTF selectors. Explicit DCM and rate-control fallback therefore use distinct descriptor-code domains; BPSK DCM TX is hardware-qualified for both S-MPDU and multi-subframe A-MPDU, while QPSK and 16-QAM still require a capable peer.</description>
              <bitOffset>7</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field><name>BSS_COLOR</name><bitOffset>8</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>VECTOR_REQUIRED_14</name><description>SOURCE[BLOB_LIBPP_HAL_HE_TX,HIL_VENDOR_HE20_MCS9_SU_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Complete mac_tx_set_hesig ORs 0x40 into the second output byte before publication; both synchronous MCS9 vendor captures retained this otherwise non-payload vector bit.</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SPATIAL_REUSE</name><bitOffset>15</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>BANDWIDTH</name><bitOffset>19</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>GI_LTF</name><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field>
            <field>
              <name>NSTS_AND_MIDAMBLE_PERIODICITY</name>
              <description>SOURCE[BLOB_LIBPP_DBG_DUMP_RX_PPDU,ESP_WIFI_SYS_S31_HE_SU_SIG,HIL_OPEN_HE20_STBC_NSTS_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Complete dbg_dump_rx_ppdu shifts HE-SIG-A1 right by 23, masks three bits and prints the value as nsts_and_midamble_periodicity. The complete vendor private header uses the same name. A live 1T1R HE-SU RX vector 0x00e0591b with STBC set in HE-SIG-A2 produced encoding one: two space-time streams created from one spatial stream. This field is therefore not an unconditional NSS-minus-one value; with Doppler enabled it also carries midamble-periodicity information.</description>
              <bitOffset>23</bitOffset><bitWidth>3</bitWidth>
            </field>
            <field><name>VECTOR_REQUIRED_HIGH</name><description>SOURCE[BLOB_LIBPP_HAL_HE_TX,HIL_VENDOR_HE20_MCS9_SU_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Complete formatter ORs 0xfc000000 before publication; both synchronous vendor captures retained all six bits.</description><bitOffset>26</bitOffset><bitWidth>6</bitWidth></field>
          </fields>
        </register>
