ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex>
          <name>DATA_LENGTH%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBPP_DBG_READ_TX_SIG,HIL_VENDOR_HT20_MCS0_SINGLE_PPDU_2026_07_29,HIL_VENDOR_HT_AMPDU_PPDU,HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Complete libpp.a[hal_mac_tx.o]::mac_tx_set_len (size 0x128) writes the packed non-HE HT data length, MCS index and entry class here. Complete dbg_read_tx_sig names the fields as the HT40 length, MCS, EOF count and TXOP count. The exact vendor single-MPDU HT20 MCS0 callback image carried 0x0000006e for length 0x6e, proving entry class zero. The independent two-MPDU MCS7 capture carried 0x70400c2e for aggregate length 0x0c2e, proving entry class one for A-MPDU. The open direct-DMA A-MPDU HIL qualified the same entry class through complete BlockAck results. Legacy formatting does not consume this queue word.</description>
          <addressOffset>0x34</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>HT40_LENGTH</name><bitOffset>0</bitOffset><bitWidth>19</bitWidth></field>
            <field><name>UNKNOWN_19_21</name><bitOffset>19</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>HT40_EOF_COUNT</name><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>HT40_TXOP_COUNT</name><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>HT40_MCS</name><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field>
          </fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex>
          <name>LENGTH_CONTROL%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,BLOB_LIBPP_DBG_READ_TX_SIG,BLOB_LIBPP_HAL_ANTENNA_INIT,MIGRATION_LMAC_TX,HIL_VENDOR_HT20_MCS0_SINGLE_PPDU_2026_07_29,HIL_VENDOR_HT_AMPDU_PPDU,HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29,HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29,HIL_OPEN_HE20_MCS0_DCM_SMPDU_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Canonical queue-vector length/rate/antenna image. Complete dbg_read_tx_sig names the low antenna-selection flags, RTS rate, HT20 EOF count and HT20 TXOP count. The upper four words of complete hal_attenna_init's eight-word traversal are these same queue-vector registers; its bit operations therefore use the canonical antenna fields below rather than a second BANK_CONTROL identity. Complete mac_tx_set_len always publishes the mac_tx_get_rts_rate result in bits 13:6, including PPDUs without explicit RTS/CTS. The exact vendor single-MPDU HT20 MCS0 callback image carried 0x000002c4, proving entry class zero; the independent two-MPDU MCS7 capture carried 0x00400244, proving entry class one. Counterintuitively, the acknowledged HE20 DCM S-MPDU also requires entry class one and carries 0x004002c4. The open direct-DMA HIL qualified both the HT aggregate and HE S-MPDU images. Complete mac_tx_get_rts_rate maps legacy OFDM 48/24/54/36 Mbit/s to basic rate 24M, 12/18M to 12M, and 6/9M to 6M.</description>
          <addressOffset>0x38</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TXRX_QUEUE_ANTENNA_LAST</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TXRX_QUEUE_ANTENNA_VALUE</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TXRX_QUEUE_ANTENNA_ENABLE</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TX_QUEUE_ANTENNA_LAST</name><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TX_QUEUE_ANTENNA_VALUE</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TX_QUEUE_ANTENNA_ENABLE</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RTS_RATE</name><bitOffset>6</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>UNKNOWN_14_21</name><bitOffset>14</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>HT20_EOF_COUNT</name><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>HT20_TXOP_COUNT</name><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>HIGH_UNKNOWN</name><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field>
          </fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex><name>HE_CONTROL_CONFIG%s</name><description>SOURCE[BLOB_LIBPP_HAL_HE_TX,BLOB_LIBNET80211_HE_CONTROL_TX,HIL_VENDOR_HE_CONTROL_INSERTION_2026_07_30,HIL_OPEN_HE_CONTROL_METADATA_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Per-queue control word at 0x20105518-logical_queue*0x7c. Complete hal_he_set_htc performs a fresh-read RMW of bit 28 after publishing HE_CONTROL: nonzero enable sets the bit and zero clears it. The vendor descriptor path supplies descriptor state bit 16, which is set only for an explicit software HE-Control image such as OMC; leaving it clear permits the hardware-generated BSR path selected by the QoS frame Order bit and Trigger-eligible TID state. Vendor DMA/air HIL proves that hardware inserts the four-byte HE-Control field between QoS Control and CCMP. The DMA buffer contains no placeholder; complete ppCalSubFrameLength accounts for the insertion through metadata byte seven bit zero. Open-driver HIL independently qualifies the same contract through WPA2, decrypted ARP and ICMP traffic.</description><addressOffset>0x40</addressOffset><size>32</size><access>read-write</access><fields><field><name>SOFTWARE_HE_CONTROL_ENABLE</name><description>Use the software HE_CONTROL word instead of the hardware-generated HE-Control value.</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_BEAMFORMING_REPORT</name>
      <description>SOURCE[BLOB_LIBPP_BFR_AVERAGE_SNR]; CONFIDENCE[instruction-exact]. Complete esp_test_get_bfr_avgsnr reads the low byte at 0x20105f94 as stream-zero average-SNR code. Code 0x7f is a special saturated/invalid value rendered with a greater-than-or-equal prefix; every other code is converted to dB as (code + 88) / 4.</description>
      <baseAddress>0x20105f94</baseAddress>
      <registers>
        <register>
          <name>AVERAGE_SNR</name>
          <description>Beamforming-report average SNR observation used by complete esp_test_get_bfr_avgsnr.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>STREAM_0_CODE</name><description>Unsigned raw code. Values other than 0x7f convert to quarter-dB units after adding 88.</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>24</bitWidth></field>
          </fields>
        </register>
