ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TX_COMPLETION</name>
      <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,MIGRATION_LMAC_TX]; CONFIDENCE[instruction-exact-hil-qualified]. Non-aliased words from four 0x7c-byte completion banks representing logical EDCA queues 3,2,1,0. AUX_A/AUX_B are canonically described by the richer TX BlockAck high-address and TX queue-information registers in WIFI_MAC_RX_DMA.</description>
      <baseAddress>0x201053b0</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex><name>PRIMARY%s</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,MIGRATION_LMAC_TX,HIL_OPEN_HE_RATE_CONTROL_ACK_SNR_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Primary completion/status word. Complete hal_mac_get_txq_complete copies bits 23:16 to result byte two independently of the primary/alternate status selector; complete lmacProcessTxSuccess stores that byte as encoded ACK SNR.</description><addressOffset>0x18</addressOffset><size>32</size><access>read-only</access><fields><field><name>ACK_SNR_ENCODED</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,HIL_OPEN_HE_RATE_CONTROL_ACK_SNR_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Complete hal_mac_get_txq_complete copies PRIMARY bits 23:16 to result byte two. Complete lmacProcessTxSuccess passes that byte into the descriptor ACK-SNR slot. Complete rcUpdateTxDone adds the pinned wDevCtrl byte 0x60 and narrows to a signed byte before rcUpdateAckSnr. This field is meaningful only for a successful completion.</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field></fields></register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex><name>ALTERNATE%s</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,MIGRATION_LMAC_TX]; CONFIDENCE[instruction-exact-partial]. Alternate completion/status word selected by the recovered auxiliary bit.</description><addressOffset>0x1c</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex><name>AUX_C%s</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,MIGRATION_LMAC_TX]; CONFIDENCE[instruction-exact-partial]. Third auxiliary completion word contributing to the second decoded extension image.</description><addressOffset>0x28</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_INIT_PREFIX</name>
      <description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_PREFIX]; CONFIDENCE[instruction-exact-partial]. Complete hal_he_init prefix through hal_init_tb_tx, stopping immediately before hal_init_tx_pwr. Twenty-two separate RMW edges and one final synchronization/status read.</description>
      <baseAddress>0x20104048</baseAddress>
      <registers>
        <register>
          <name>RX_FIELD_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_PREFIX,BLOB_LIBPP_HAL_RX_DEBUG_COUNTERS,BLOB_LIBNET80211_IEEE80211_PARSE_HEOPR,MIGRATION_HE20_PEER]; CONFIDENCE[instruction-exact]. Canonical RX_HE_BSS_COLOR_CONF word. Complete dbg_read_color_collision names the fields; the HE init parent replaces TIMEOUT_SECONDS bits 8:3 with 0x3c. HE Operation programming sets BITMAP_CONTROL bit zero to clear the accumulated BSS-color collision bitmap, so the clear action is a semantic view of the existing two-bit field rather than a second register identity.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>BITMAP_CONTROL</name><description>Complete dbg_read_color_collision prints this two-bit value as BITMAP and separately prints its low bit as COLOR_BITMAP_CLR. COLOR_BITMAP_CLR is therefore a semantic view of BITMAP_CONTROL[0], not a second overlapping SVD field.</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>TIMEOUT_SECONDS</name><bitOffset>3</bitOffset><bitWidth>6</bitWidth></field><field><name>COLLISION_THRESHOLD</name><bitOffset>9</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
        <register>
          <name>BF_MODE_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_PREFIX,BLOB_LIBPP_TEST_BF_SET_FEEDBACK]; CONFIDENCE[instruction-exact-partial]. Complete hal_init_bf clears bit two, then sets bit three through a separate fresh-read RMW. Complete esp_test_bf_set_feedback proves these same physical fields are the high-selector class and parity controls for its feedback modes; this is one canonical register identity rather than an address alias.</description>
          <addressOffset>0x54</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>HIGH_SELECTOR_CLASS</name><description>SOURCE[BLOB_LIBPP_TEST_BF_SET_FEEDBACK]; CONFIDENCE[instruction-exact-partial]. For test feedback selector values eight through fourteen, set exactly when selector is greater than nine. Complete hal_init_bf clears it.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_SELECTOR_PARITY</name><description>SOURCE[BLOB_LIBPP_TEST_BF_SET_FEEDBACK]; CONFIDENCE[instruction-exact-partial]. For test feedback selector values eight through fourteen, receives selector bit zero; selectors fifteen and sixteen clear it. Complete hal_init_bf sets it.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>BF_REPORT_RATE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_PREFIX,BLOB_LIBPP_HAL_BF_CONFIG]; CONFIDENCE[instruction-exact]. Three independently published beamforming-report profiles selected for BPSK, QPSK and 16-QAM. Complete hal_he_set_bf_report_rate(1,0x10,0,0) writes signal mode one, normalized rate zero, DCM false and ER-SU false into the 16-QAM, QPSK and BPSK profiles in that order.</description>
          <addressOffset>0x41c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>BPSK_RATE</name><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>BPSK_SIGNAL_MODE</name><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>BPSK_DCM</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BPSK_ERSU</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>QPSK_RATE</name><bitOffset>9</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>QPSK_SIGNAL_MODE</name><bitOffset>14</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>QPSK_DCM</name><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>QPSK_ERSU</name><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>QAM16_RATE</name><bitOffset>18</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>QAM16_SIGNAL_MODE</name><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>QAM16_DCM</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>QAM16_ERSU</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>

          </fields>
        </register>
        <register>
          <name>BF_VECTOR_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_PREFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_init_bf replaces bits 23:12 with 0x801.</description>
          <addressOffset>0x434</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>IMAGE_UNKNOWN</name><bitOffset>12</bitOffset><bitWidth>12</bitWidth></field></fields>
        </register>
        <register>
          <name>BF_ENABLE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_PREFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_init_bf sets bit 31.</description>
          <addressOffset>0x438</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>ENABLE_UNKNOWN</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>PARENT_ENABLE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_PREFIX,BLOB_LIBPP_ISR_REGISTER_DUMP]; CONFIDENCE[instruction-exact-partial]. Parent sets bit 12 before trigger-based TX init. Complete print_isr_regs independently names this same physical word WDEV_INT1_ENABLE. This is one canonical register with two observed roles, not two peripheral owners.</description>
          <addressOffset>0xbe4</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>ENABLE_UNKNOWN</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>INTERRUPT_1_RAW</name>
          <description>SOURCE[BLOB_LIBPP_ISR_REGISTER_DUMP]; CONFIDENCE[instruction-exact]. WDEV_INT1_RAW diagnostic snapshot read by complete print_isr_regs. No write behavior is inferred from this diagnostic reader.</description>
          <addressOffset>0xbe8</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>EVENTS</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>INTERRUPT_1_STATUS</name>
          <description>SOURCE[BLOB_LIBPP_ISR_REGISTER_DUMP]; CONFIDENCE[instruction-exact]. WDEV_INT1_STATUS diagnostic snapshot read by complete print_isr_regs.</description>
          <addressOffset>0xbec</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>EVENTS</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>INTERRUPT_1_CLEAR</name>
          <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact]. Complete hal_mac_interrupt_clr_bsscolor sets bit 12 through a fresh-read RMW to acknowledge the secondary BSS-color event.</description>
          <addressOffset>0xbf0</addressOffset><size>32</size><access>read-write</access><modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields><field><name>BSS_COLOR</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>BF_TIMING_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_PREFIX,BLOB_LIBPP_HAL_BF_CONFIG,BLOB_LIBPP_HAL_BF_DEBUG_CONTROL,BLOB_LIBPP_TEST_HAL_CSI]; CONFIDENCE[instruction-exact-partial]. Seven ordered RMWs in complete hal_init_bf. Complete dbg_read_rx_misc supplies the beamforming field names through its WDEVBEAMFORMCONF decoder. Complete dbg_disable_report_cbf independently proves the write polarity of HE_BEAM_ENABLE bit 20. Complete esp_test_get_csi_dump_cfg supplies the more specific RXBFRPTO_MS name for bits 7:1.</description>
          <addressOffset>0xc30</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>BF_MEMORY_WRITE_ENABLE</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>RX_BFRP_TIMEOUT_MS</name><description>SOURCE[BLOB_LIBPP_TEST_HAL_CSI]; CONFIDENCE[instruction-exact]. Vendor test getter names bits 7:1 RXBFRPTO_MS.</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>HE_BEAM_NDP_TIME</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>HE_BEAM_HW_SEQUENCE_SELECT</name><bitOffset>16</bitOffset><bitWidth>3</bitWidth></field><field><name>HE_BEAM_HW_SEQUENCE_ENABLE</name><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>HE_BEAM_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_BF_CONFIG,BLOB_LIBPP_HAL_BF_DEBUG_CONTROL]; CONFIDENCE[instruction-exact]. Complete dbg_read_rx_misc names bit 20 HE_BEAM_ENA. Complete dbg_disable_report_cbf clears it for a nonzero disable argument and sets it for zero, connecting the general hardware label to compressed-beamforming-report output.</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>NON_TB_BEAM_RU_SELECT</name><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>BEAM_RU_SELECT</name><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>CLEAR_UNKNOWN_23</name><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>ENABLE_UNKNOWN_25</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>BF_HIGH_IMAGE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_PREFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_init_bf replaces bits 31:20 with 0x690.</description>
          <addressOffset>0xd9c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>IMAGE_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>12</bitWidth></field></fields>
        </register>
        <register>
          <name>TB_TX_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_PREFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_init_tb_tx clears bit 15, then bit 14 through a separate fresh-read RMW.</description>
          <addressOffset>0xdbc</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>CLEAR_14</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CLEAR_15</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
