ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_TB_STATISTICS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_HE_TB_DIAGNOSTICS,HIL_OPEN_HE_TB_COUNTER_BASELINE_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Hardware counters read by the complete hal_he_get_rx_trigger_cnt, hal_he_get_tb_times_cnt and hal_he_get_tb_qosnull_cnt leaves. These counters distinguish Trigger reception from actual trigger-based transmission and appended QoS Null responses. An ordinary controlled HE SU AP produced no Trigger frames, so all three remained zero during sustained HE DCM A-MPDU traffic.</description>
      <baseAddress>0x201043a0</baseAddress>
      <registers>
        <register>
          <name>RX_TRIGGER</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_TB_DIAGNOSTICS]; CONFIDENCE[instruction-exact]. Complete hal_he_get_rx_trigger_cnt returns the low sixteen bits.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>HIGH_COUNT_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields>
        </register>
        <register>
          <name>TB_TRANSMISSION</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_TB_DIAGNOSTICS]; CONFIDENCE[instruction-exact]. Complete hal_he_get_tb_times_cnt returns the low sixteen bits; complete hal_he_get_tb_qosnull_cnt returns the high sixteen bits.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>QOS_NULL_COUNT</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_TB_DIAGNOSTICS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_HE_TB_DIAGNOSTICS,HIL_OPEN_HE_TB_COUNTER_BASELINE_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Four read-only hardware result words decoded by complete dbg_read_axtb_diag and its four complete getter leaves. The names come from the pinned blob's own format strings; no field meaning is inferred from reset images. All four words remained zero when the controlled AP sent no Trigger frames.</description>
      <baseAddress>0x201044f4</baseAddress>
      <registers>
        <register>
          <name>TIMING</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_TB_DIAGNOSTICS]; CONFIDENCE[instruction-exact]. WDEVAXTBDIAG0.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>TX_TIME</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>SYMBOL_COUNT</name><bitOffset>16</bitOffset><bitWidth>10</bitWidth></field><field><name>PRE_FEC_PADDING_PHY</name><bitOffset>26</bitOffset><bitWidth>6</bitWidth></field></fields>
        </register>
        <register>
          <name>PSDU</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_TB_DIAGNOSTICS]; CONFIDENCE[instruction-exact]. WDEVAXTBDIAG1.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>PSDU_LENGTH</name><bitOffset>0</bitOffset><bitWidth>17</bitWidth></field><field><name>MINIMUM_SUBFRAME_LENGTH</name><bitOffset>17</bitOffset><bitWidth>10</bitWidth></field><field><name>PACKET_EXTENSION_TIME</name><bitOffset>27</bitOffset><bitWidth>5</bitWidth></field></fields>
        </register>
        <register>
          <name>TRIGGER</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_TB_DIAGNOSTICS]; CONFIDENCE[instruction-exact]. WDEVAXTBDIAG2.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>TX_20_PACKET_COUNT</name><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field><field><name>QOS_NULL_APPEND_COUNT</name><bitOffset>7</bitOffset><bitWidth>4</bitWidth></field><field><name>TRIGGER_TYPE</name><bitOffset>11</bitOffset><bitWidth>4</bitWidth></field><field><name>UPLINK_LENGTH</name><bitOffset>15</bitOffset><bitWidth>12</bitWidth></field><field><name>GI_AND_LTF</name><bitOffset>27</bitOffset><bitWidth>2</bitWidth></field><field><name>TID_LIMIT</name><bitOffset>29</bitOffset><bitWidth>3</bitWidth></field></fields>
        </register>
        <register>
          <name>USER</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_TB_DIAGNOSTICS]; CONFIDENCE[instruction-exact]. WDEVAXTBDIAG3.</description>
          <addressOffset>0x0c</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>ASSOCIATION_ID</name><bitOffset>0</bitOffset><bitWidth>13</bitWidth></field><field><name>RU_ALLOCATION</name><bitOffset>13</bitOffset><bitWidth>7</bitWidth></field><field><name>UPLINK_MCS</name><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>BASIC_PREFERRED_AC</name><bitOffset>24</bitOffset><bitWidth>2</bitWidth></field><field><name>BASIC_SPACING_FACTOR</name><bitOffset>26</bitOffset><bitWidth>2</bitWidth></field><field><name>UPLINK_PACKET_EXTENSION</name><bitOffset>28</bitOffset><bitWidth>3</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_BUFFER_STATUS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_HE_BSR_DEBUG,BLOB_LIBPP_HAL_HE_BSR_STATUS,BLOB_LIBPP_MAC_TX_SET_TB,BLOB_LIBPP_DBG_READ_TX_PPDU,ROM_REV0_MAC_TX_SET_TB,BLOB_LIBNET80211_HE_TID_BITMAP,HIL_OPEN_HE_BSR_TID_LIFECYCLE_2026_07_29,HIL_OPEN_HE_TB_QUEUE_PUBLICATION_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Eight interleaved hardware/software Buffer Status Report values and their shared control. Complete dbg_read_bsr_info names every exposed field. Complete hal_he_get_hw_txq_bsr independently proves the eight-byte stride and low twenty-bit hardware value. The independent blob and ROM mac_tx_set_tb bodies prove the write-side scheduler interpretation: for logical queues zero through three they replace the corresponding software BSR low twenty bits with the sum of every linked frame-state halfword at offset 0x22, then OR the queue bit into CONTROL[7:0]. Complete dbg_read_tx_ppdu independently names that exact halfword msdu_len, proving that this is an original-MSDU byte sum rather than MPDU, PSDU or encoded A-MPDU length. Complete HE BlockAck response/deletion paths separately select and clear TID_BITMAP bits through hal_he_set_tid_bitmap and hal_he_clr_tid_bitmap. Open HE HIL observed TID_BITMAP=1 immediately after the successful TID0 AddBA transition while sustained DCM A-MPDU remained clean. A later rev0 HIL reproduced the complete ROM write order with a 47104-byte TID0 queue: CONTROL validity read back one while SOFTWARE_BSR already read zero. This qualifies the write-side address and validity edge but leaves the zero as a live-update/read-latch ambiguity until a real AP Trigger is observed.</description>
      <baseAddress>0x20104d74</baseAddress>
      <registers>
        <register><dim>8</dim><dimIncrement>0x08</dimIncrement><dimIndex>0-7</dimIndex>
          <name>HARDWARE_BSR%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_BSR_DEBUG,BLOB_LIBPP_HAL_HE_BSR_STATUS]; CONFIDENCE[instruction-exact]. WDEVTXQBSR_HW[0-7].</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>20</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>12</bitWidth></field></fields>
        </register>
        <register><dim>8</dim><dimIncrement>0x08</dimIncrement><dimIndex>0-7</dimIndex>
          <name>SOFTWARE_BSR%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_BSR_DEBUG,BLOB_LIBPP_MAC_TX_SET_TB,BLOB_LIBPP_DBG_READ_TX_PPDU,ROM_REV0_MAC_TX_SET_TB,HIL_OPEN_HE_TB_QUEUE_PUBLICATION_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. WDEVTXQBSR_SW[0-7]. The debug decoder reads all eight low-twenty-bit values. Complete blob and ROM mac_tx_set_tb independently prove write semantics for logical queues zero through three: preserve bits 31:20 and replace VALUE with the sum of linked frame-state +0x22 halfwords before publishing the queue-ready bit. Complete dbg_read_tx_ppdu names that halfword msdu_len. Rev0 open HIL programmed 47104 for logical queue two with the exact ROM sequence, then observed VALUE zero immediately after validity became visible. Treat reads as live hardware state rather than durable software-write readback until a Trigger HIL resolves whether the value was consumed or rejected.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>VALUE</name><description>Software BSR value. On the recovered Trigger-based TX path this is the low-twenty-bit sum of the original MSDU lengths from linked frame-state +0x22, not the encoded MPDU/PSDU lengths.</description><bitOffset>0</bitOffset><bitWidth>20</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>12</bitWidth></field></fields>
        </register>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_BSR_DEBUG,BLOB_LIBPP_MAC_TX_SET_TB,ROM_REV0_MAC_TX_SET_TB,BLOB_LIBNET80211_HE_TID_BITMAP,HIL_OPEN_HE_BSR_TID_LIFECYCLE_2026_07_29,HIL_OPEN_HE_TB_QUEUE_PUBLICATION_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. WDEVTXQBSR_CTRL. Complete dbg_read_bsr_info decodes all fields below. Complete blob and ROM mac_tx_set_tb perform a fresh-read RMW that ORs 1&lt;&lt;logical_queue into bits 7:0 after the queue configuration and software BSR value are visible; the debug function names these bits WDEVTXQBSR_VD[0-7], so the neutral validity name is retained. Complete hal_he_set_tid_bitmap and hal_he_clr_tid_bitmap independently update TID_BITMAP through two fresh reads followed by one write. Open HE HIL qualified the TID0 set edge after successful AddBA and later read back logical queue two validity immediately after the exact ROM publication sequence.</description>
          <addressOffset>0x44</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>VALID_BITMAP</name><description>WDEVTXQBSR_VD[0-7]. Complete mac_tx_set_tb proves that bits zero through three are also the write-side Trigger-ready bits selected by logical queue number; no source yet proves whether hardware subsequently translates those queue bits into per-TID validity.</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>AC_EMPTY_SOFTWARE_TID</name><description>TID used when AC_EMPTY_USE_SW_TID is set.</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>AC_EMPTY_USE_SOFTWARE_TID</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TID_BITMAP</name><description>Trigger-based TIDs enabled by successful HE BlockAck setup.</description><bitOffset>13</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>BASIC_SPECIAL_BSR_SEQUENCE</name><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TID_LIMIT_ZERO_BSR_SEQUENCE</name><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HIGH_UNKNOWN</name><bitOffset>23</bitOffset><bitWidth>9</bitWidth></field>
          </fields>
        </register>
