ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_MU_EDCA_TIMER</name>
      <description>SOURCE[BLOB_LIBPP_HAL_HE_MU_EDCA_DEBUG,BLOB_LIBPP_MAC_TX_SET_TB,ROM_REV0_MAC_TX_SET_TB,HIL_OPEN_HE_QUEUE_SCHEDULING_BASELINE_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Four MU-EDCA timer words decoded by complete dbg_read_muedca_timer. Durations are reported by the blob in eight-TU units. Complete blob and ROM mac_tx_set_tb set ENABLE in the timer selected by the logical TX queue before publishing the Trigger queue configuration. After open HE association and TID0 AddBA, all four ordinary-SU baseline words had ENABLE=0, TIMER/CURRENT/AIFS=0 and REACHED=1; that pre-port baseline AP emitted no Trigger frame.</description>
      <baseAddress>0x20104dbc</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x04</dimIncrement><dimIndex>0-3</dimIndex>
          <name>TIMER%s</name>
          <description>WDEVMUEDCA_TIMER[0-3].</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>TIMER_8TU</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>ENABLE</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>RESET</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CURRENT_COUNT_8TU</name><bitOffset>10</bitOffset><bitWidth>8</bitWidth></field><field><name>REACHED</name><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>AIFS</name><bitOffset>19</bitOffset><bitWidth>4</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>23</bitOffset><bitWidth>9</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_TRIGGER_RX_DIAGNOSTICS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_HE_TRIGGER_RX_DIAGNOSTICS]; CONFIDENCE[instruction-exact]. Ten hardware diagnostic words decoded by complete dbg_read_ax_diag. The blob explicitly warns that these words are not latched and can be updated by a following RX frame; consume them only as best-effort diagnostics adjacent to a known Trigger reception.</description>
      <baseAddress>0x20104508</baseAddress>
      <registers>
        <register>
          <name>STATE</name>
          <description>WDEVAXDIAG0.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>TRIGGER_STATE_CS</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>UNKNOWN_3</name><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRX_BEAM</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRX_CTS</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRX_BLOCK_ACK</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRX_ACK</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRX_IS_TB</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRX_IS_WAITING</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>UNKNOWN_10_11</name><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>BFRP_TIMER</name><bitOffset>12</bitOffset><bitWidth>7</bitWidth></field><field><name>BFRP_DETECT_ENABLE</name><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>BEAM_TIMER</name><bitOffset>20</bitOffset><bitWidth>6</bitWidth></field><field><name>UNKNOWN_26</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>NDP_DETECT_SUCCESS</name><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
        <register>
          <name>LENGTH</name>
          <description>WDEVAXDIAG1.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>SYMBOL_COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>TB_APEP_LENGTH</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields>
        </register>
        <register>
          <name>EOF_PADDING</name>
          <description>WDEVAXDIAG2. Padding bytes exclude the final subframe padding bytes.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>TB_BYTES</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>SU_BYTES</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields>
        </register>
        <register>
          <name>PADDING</name>
          <description>WDEVAXDIAG3.</description>
          <addressOffset>0x0c</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>PACKET_EXTENSION_TIME</name><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>UNKNOWN_5_7</name><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>SU_A_FACTOR</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>SU_PE_DISAMBIGUITY</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FEEDBACK_STATUS</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SU_PRE_FEC_PADDING</name><bitOffset>12</bitOffset><bitWidth>5</bitWidth></field><field><name>UNKNOWN_17_19</name><bitOffset>17</bitOffset><bitWidth>3</bitWidth></field><field><name>TB_PRE_FEC_PADDING</name><bitOffset>20</bitOffset><bitWidth>5</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>25</bitOffset><bitWidth>7</bitWidth></field></fields>
        </register>
        <register>
          <name>TRIGGER_DEPENDENT</name>
          <description>WDEVAXDIAG4.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>STA_MATCH</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>NFRP_MULTIPLEX_FLAG</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>BASIC_PREFERRED_AC</name><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>NFRP_FEEDBACK_TYPE</name><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>BFRP_FEEDBACK_BITMAP</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>BASIC_TARGET_RSSI</name><bitOffset>16</bitOffset><bitWidth>7</bitWidth></field><field><name>BASIC_UL_DCM</name><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>BASIC_SPATIAL_STREAM_ALLOCATION</name><bitOffset>24</bitOffset><bitWidth>6</bitWidth></field><field><name>BASIC_MU_MIMO_SPATIAL_STREAM_FACTOR</name><bitOffset>30</bitOffset><bitWidth>2</bitWidth></field></fields>
        </register>
        <register>
          <name>BASIC_USER</name>
          <description>WDEVAXDIAG5.</description>
          <addressOffset>0x14</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>TID_LIMIT</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>UL_MCS</name><bitOffset>3</bitOffset><bitWidth>4</bitWidth></field><field><name>FEC_CODING_TYPE</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>RU_ALLOCATION_RAW</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>RX_AID</name><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
        <register>
          <name>COMMON_PHY</name>
          <description>WDEVAXDIAG6.</description>
          <addressOffset>0x18</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>HE_SIG_A2_RESERVED</name><bitOffset>0</bitOffset><bitWidth>9</bitWidth></field><field><name>DOPPLER</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>STBC</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>MU_MIMO_LTF</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>GI_AND_LTF_TYPE</name><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>UL_BANDWIDTH</name><bitOffset>14</bitOffset><bitWidth>2</bitWidth></field><field><name>SPATIAL_REUSE</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields>
        </register>
        <register>
          <name>COMMON_TRIGGER</name>
          <description>WDEVAXDIAG7.</description>
          <addressOffset>0x1c</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>UL_LENGTH</name><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field><field><name>TRIGGER_TYPE</name><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>UL_PACKET_EXTENSION</name><bitOffset>16</bitOffset><bitWidth>3</bitWidth></field><field><name>AP_TX_POWER</name><bitOffset>19</bitOffset><bitWidth>6</bitWidth></field><field><name>NUMBER_OF_LTF</name><bitOffset>25</bitOffset><bitWidth>3</bitWidth></field><field><name>CS_REQUIRED</name><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>MORE_TF</name><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>30</bitOffset><bitWidth>2</bitWidth></field></fields>
        </register>
        <register>
          <name>TRS</name>
          <description>WDEVAXDIAG8.</description>
          <addressOffset>0x20</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>RU_ALLOCATION</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>MCS</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>TARGET_RSSI</name><bitOffset>10</bitOffset><bitWidth>5</bitWidth></field><field><name>DOWNLINK_POWER</name><bitOffset>15</bitOffset><bitWidth>5</bitWidth></field><field><name>UL_SYMBOL_COUNT</name><bitOffset>20</bitOffset><bitWidth>5</bitWidth></field><field><name>CONTAINS_TRS</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>26</bitOffset><bitWidth>6</bitWidth></field></fields>
        </register>
        <register>
          <name>PACKET_COUNTS</name>
          <description>WDEVAXDIAG9.</description>
          <addressOffset>0x24</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>CBW80_PACKET_COUNT</name><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field><field><name>CBW40_PACKET_COUNT</name><bitOffset>6</bitOffset><bitWidth>6</bitWidth></field><field><name>CBW20_PACKET_COUNT</name><bitOffset>12</bitOffset><bitWidth>6</bitWidth></field><field><name>QOS_NULL_APPEND_PACKET_COUNT</name><bitOffset>18</bitOffset><bitWidth>6</bitWidth></field><field><name>AX_MATCH_BSSID1</name><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>AX_MATCH_BSSID0</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>BSS_COLOR_VALID</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>RX_AMPDU_AUTO_ACK_VALID</name><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
