ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_BEAMFORMING_FEEDBACK_TEST</name>
      <description>SOURCE[BLOB_LIBPP_TEST_BF_SET_FEEDBACK]; CONFIDENCE[instruction-exact-partial]. Test-only beamforming-feedback selector written by complete esp_test_bf_set_feedback. The write transforms and selector branches are exact; the public meaning of selector values zero through sixteen is not present in the archive, so only bounded functional names are assigned.</description>
      <baseAddress>0x20104e00</baseAddress>
      <registers>
        <register>
          <name>CONFIGURATION</name>
          <description>SOURCE[BLOB_LIBPP_TEST_BF_SET_FEEDBACK]; CONFIDENCE[instruction-exact-partial]. A zero enable argument clears ENABLE only. A nonzero argument first sets ENABLE, clears FEEDBACK_SUBMODE_B, replaces both seven-bit auxiliary arguments, then applies selector-dependent updates to the remaining submode fields. Selector sixteen replaces the complete word with ENABLE plus FEEDBACK_SUBMODE_B value one.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>AUXILIARY_ARGUMENT_LOW</name><description>Low seven-bit argument passed as esp_test_bf_set_feedback argument two.</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field>
            <field><name>AUXILIARY_ARGUMENT_HIGH</name><description>High seven-bit argument passed as esp_test_bf_set_feedback argument three.</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth></field>
            <field><name>FEEDBACK_SUBMODE_A</name><description>Three-bit selector-dependent field. Complete branches publish one for selector thirteen and five for selector fourteen.</description><bitOffset>14</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>FEEDBACK_SELECTOR_LOW</name><description>For selectors zero through seven this field receives the three-bit selector. The higher selector classes update it only partially or clear it.</description><bitOffset>17</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>FEEDBACK_SUBMODE_B</name><description>Three-bit selector-dependent field. The common enabled prefix clears it; selectors twelve and sixteen publish one.</description><bitOffset>20</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>ENABLE</name><description>A nonzero enable argument sets this bit; zero clears it.</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_HE_OBSS_NARROW_BAND_RU</name>
      <description>SOURCE[BLOB_LIBPP_HAL_HE_OBSS_NARROW_BAND_RU]; CONFIDENCE[instruction-exact-partial]. Complete hal_he_disable_obss_narrow_bw_ru writes either all ones or zero into the twenty-bit bitmap and independently sets or clears a five-bit class group and the global disable bit. The leaf name proves the aggregate disable function; individual bitmap/class identities remain approximate.</description>
      <baseAddress>0x20104e9c</baseAddress>
      <registers>
        <register>
          <name>DISABLE_BITMAP</name>
          <description>Twenty-bit OBSS narrow-band RU disable bitmap written as 0xfffff when disabled and zero when enabled.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>20</bitWidth></field></fields>
        </register>
        <register>
          <name>CONTROL</name>
          <description>The complete leaf updates CLASS_DISABLE bits first and GLOBAL_DISABLE second through independent fresh-read RMWs.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>GLOBAL_DISABLE</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CLASS_DISABLE</name><description>Approximate functional name for the five bits toggled together by hal_he_disable_obss_narrow_bw_ru.</description><bitOffset>4</bitOffset><bitWidth>5</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TX_POWER_INIT</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TX_POWER_INIT,BLOB_LIBNET80211_PARTIAL_RU_MAX_POWER,ROM_REV0_PHY_GET_MAX_PWR]; CONFIDENCE[instruction-exact-partial]. Complete hal_init_tx_pwr consumes 43 two-byte PHY power results, then complete TB, immediate-response and TB-RU leaves publish 56 ordered fresh-read RMW edges. Runtime partial-RU get/set APIs select the same packed fields by the raw Trigger RU allocation. Values are PHY gain-table indices, not dBm.</description>
      <baseAddress>0x20104408</baseAddress>
      <registers>
        <register><dim>10</dim><dimIncrement>0x04</dimIncrement><dimIndex>0-9</dimIndex>
          <name>IMMEDIATE_RESPONSE%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TX_POWER_INIT]; CONFIDENCE[instruction-exact-partial]. Ten immediate-response command words. Complete hal_init_imrsp_power separately replaces format, rate and power-index fields in that order.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>POWER_INDEX</name><description>PHY gain-table index selected for the response rate; not dBm.</description><bitOffset>8</bitOffset><bitWidth>6</bitWidth></field>

            <field><name>RATE_INDEX</name><bitOffset>16</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>FORMAT_UNKNOWN</name><description>Zero for the six legacy response words and two for the four HE response words.</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field>

          </fields>
        </register>
        <register><dim>3</dim><dimIncrement>0x04</dimIncrement><dimIndex>0-2</dimIndex>
          <name>TB_POWER%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TX_POWER_INIT]; CONFIDENCE[instruction-exact]. Three trigger-based power words populated from rates 16 through 25. Each used six-bit field is updated through a separate RMW.</description>
          <addressOffset>0x28</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>POWER_0</name><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>POWER_1</name><bitOffset>8</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>POWER_2</name><bitOffset>16</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>POWER_3</name><bitOffset>24</bitOffset><bitWidth>6</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>TB_RU_POWER_TAIL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TX_POWER_INIT,BLOB_LIBNET80211_PARTIAL_RU_MAX_POWER]; CONFIDENCE[instruction-exact]. Complete hal_init_tb_ru_power publishes the unadjusted rate-16 power at raw Trigger RU selector 61. Complete runtime get/set leaves address this same six-bit field; selector 62 is rejected.</description>
          <addressOffset>0x34</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>POWER_INDEX</name><bitOffset>24</bitOffset><bitWidth>6</bitWidth></field></fields>
        </register>
        <register><dim>3</dim><dimIncrement>0x04</dimIncrement><dimIndex>0-2</dimIndex>
          <name>TB_RU_POWER%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TX_POWER_INIT,BLOB_LIBNET80211_PARTIAL_RU_MAX_POWER]; CONFIDENCE[instruction-exact]. Packed trigger-based resource-unit power deltas selected by raw Trigger RU allocation. Complete runtime get/set jump tables admit only selectors 0 through 8, 37 through 40, 53, 54 and 61; the first fifteen selectors occupy these packed words and selector 61 occupies TB_RU_POWER_TAIL.</description>
          <addressOffset>0x38</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>POWER_0</name><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>POWER_1</name><bitOffset>6</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>POWER_2</name><bitOffset>12</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>POWER_3</name><bitOffset>18</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>POWER_4</name><bitOffset>24</bitOffset><bitWidth>6</bitWidth></field>

          </fields>
        </register>
