ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
            <field><name>FIRST_CLEAR_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact]. Cleared for all eight words in the first reverse traversal.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SECOND_CLEAR_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact]. Cleared in the first RMW of each word in the second reverse traversal.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>THIRD_CLEAR_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact]. Cleared in the third RMW of each word in the second reverse traversal.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BANK_ENABLE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact]. Set in the middle RMW of each word in the second reverse traversal.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>

          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TXRX_PREFIX</name>
      <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX,BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact-partial]. Eighteen direct fresh-read RMW edges before the first external HE callback in complete mac_txrx_init; complete hal_init later repeats the bit-28 set edge.</description>
      <baseAddress>0x201040fc</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-3</dimIndex>
          <name>RX_QUEUE_DEFAULT%s</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Four queue words have their high half cleared independently; queue zero and one then receive separate bit-24 and bit-26 set edges.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>HIGH_23_16_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>QUEUE_BIT_24_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>QUEUE_BIT_25_UNKNOWN</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>QUEUE_BIT_26_UNKNOWN</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HIGH_31_27_UNKNOWN</name><bitOffset>27</bitOffset><bitWidth>5</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>CONTROL_EDGES</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete prefix sets bit 0, then bit 4 through a second fresh-read RMW.</description>
          <addressOffset>0x18</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>FIRST_ENABLE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>SECOND_ENABLE_UNKNOWN</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>

          </fields>
        </register>
        <register>
          <name>TIMING_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX]; CONFIDENCE[instruction-exact-partial]. Complete prefix sets bit 31, then replaces bits 27:20 with 0x1b in a separate RMW.</description>
          <addressOffset>0x1c</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>TIMING_IMAGE_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>8</bitWidth></field>

            <field><name>ENABLE_UNKNOWN</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>FEATURE_EDGES</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX,BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact-semantics-unknown]. Four separately ordered prefix updates: first set bits 31,23,15,13 together; set bit 12; set bit 28; later set bit 9 after queue defaults. Complete hal_init repeats the bit-28 set after antenna initialization.</description>
          <addressOffset>0xb90</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>LATE_ENABLE_UNKNOWN</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>SECOND_ENABLE_UNKNOWN</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FIRST_GROUP_BIT_13_UNKNOWN</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>FIRST_GROUP_BIT_15_UNKNOWN</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>FIRST_GROUP_BIT_23_UNKNOWN</name><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>THIRD_ENABLE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX,BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact]. Set once in mac_txrx_init and again at hal_init offset 0xe2 after the interrupt-mask store.</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>FIRST_GROUP_BIT_31_UNKNOWN</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>MODE_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX,BLOB_LIBPP_HAL_HE_INIT_SUFFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Canonical multifunction word. Complete mac_txrx prefix clears bit 3; the HE init suffix independently sets bit 2.</description>
          <addressOffset>0xb9c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>HE_ENABLE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_SUFFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete HE init suffix sets bit 2.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>INIT_CLEAR_UNKNOWN</name><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>SHARED_ENABLE_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Final prefix RMW sets bits 1:0 together immediately before the first HE callback.</description>
          <addressOffset>0xba4</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>ENABLE_GROUP_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields>
        </register>
