ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TXRX_CALLBACKS</name>
      <description>SOURCE[BLOB_LIBPP_MAC_TXRX_CALLBACKS]; CONFIDENCE[instruction-exact]. Hardware effects of the three HE callbacks between the direct mac_txrx_init prefix and suffix. Diagnostic logging calls are intentionally omitted.</description>
      <baseAddress>0x2010444c</baseAddress>
      <registers>
        <register>
          <name>ACK_RATE_TABLE</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_CALLBACKS,BLOB_LIBPP_HAL_RESPONSE_RATE_DEBUG]; CONFIDENCE[instruction-exact]. ACK_TAB0. hal_he_set_ack_rate(0) publishes 0x00090a0b; complete dbg_read_ack_rate names its three byte lanes.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>BPSK_RATE</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>QPSK_RATE</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>QAM16_RATE</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields>
        </register>
        <register>
          <name>ACK_CCK_RATE_TABLE</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_CALLBACKS,BLOB_LIBPP_HAL_RESPONSE_RATE_DEBUG]; CONFIDENCE[instruction-exact]. ACK_TAB1. hal_he_set_ack_rate(0) publishes 0x00050100; complete dbg_read_ack_rate names the 1M, 2M and short-preamble 2M lanes.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>RATE_1M</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>RATE_2M</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>RATE_2M_SHORT_PREAMBLE</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields>
        </register>
        <register>
          <name>ACK_SCCK_RATE_TABLE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_RESPONSE_RATE_DEBUG]; CONFIDENCE[instruction-exact]. ACK_SCCKTAB, decoded by complete dbg_read_ack_rate. The cold setter does not alter this word.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>LR0_RATE</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>LR1_RATE</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>LR2_RATE</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>LR3_RATE</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields>
        </register>
        <register>
          <name>CTS_RATE_TABLE</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_CALLBACKS,BLOB_LIBPP_HAL_RESPONSE_RATE_DEBUG]; CONFIDENCE[instruction-exact]. CTS_TAB0. hal_he_set_ack_rate(0) publishes 0x00090a0b; complete dbg_read_cts_rate names its three byte lanes.</description>
          <addressOffset>0x0c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>BPSK_RATE</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>QPSK_RATE</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>QAM16_RATE</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields>
        </register>
        <register>
          <name>CTS_CCK_RATE_TABLE</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_CALLBACKS,BLOB_LIBPP_HAL_RESPONSE_RATE_DEBUG]; CONFIDENCE[instruction-exact]. CTS_TAB1. hal_he_set_ack_rate(0) publishes 0x00050100; complete dbg_read_cts_rate names the 1M, 2M and short-preamble 2M lanes.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>RATE_1M</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>RATE_2M</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>RATE_2M_SHORT_PREAMBLE</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields>
        </register>
        <register>
          <name>CTS_SCCK_RATE_TABLE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_RESPONSE_RATE_DEBUG]; CONFIDENCE[instruction-exact]. CTS_SCCKTAB, decoded by complete dbg_read_cts_rate. The cold setter does not alter this word.</description>
          <addressOffset>0x14</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>LR0_RATE</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>LR1_RATE</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>LR2_RATE</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>LR3_RATE</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields>
        </register>
        <register>
          <name>BB_RX_HANG_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_CALLBACKS,BLOB_LIBPP_MAC_TXRX_INIT_SUFFIX]; CONFIDENCE[instruction-exact-partial]. Canonical multifunction word. hal_he_set_bbrxhung_time(0) replaces the low twelve bits with 0x00f; the direct mac_txrx_init suffix later sets bits 31 and 30 through two fresh-read RMWs.</description>
          <addressOffset>0x7d0</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>TIMEOUT_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field><field><name>TXRX_SUFFIX_SECOND_ENABLE_UNKNOWN</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRX_SUFFIX_FIRST_ENABLE_UNKNOWN</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>DELAY_SECONDARY</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_CALLBACKS,BLOB_LIBPP_HAL_WDEV_DELAY_DEBUG,ROM_REV0_PHY_SIFS_REG_INIT]; CONFIDENCE[instruction-exact-partial]. WDEVDELAY1. On-chip hal_he_set_mac_delay uses random slot 0..10 for bits 30:21, while complete phy_sifs_reg_init writes 0xea to that field.</description>
          <addressOffset>0x808</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>TX_CCK_DELAY</name><description>SOURCE[BLOB_LIBPP_HAL_WDEV_DELAY_DEBUG]; CONFIDENCE[instruction-exact].</description><bitOffset>10</bitOffset><bitWidth>11</bitWidth></field><field><name>HIGH_DELAY_UNKNOWN</name><bitOffset>21</bitOffset><bitWidth>10</bitWidth></field></fields>
        </register>
        <register>
          <name>DELAY_PRIMARY</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_CALLBACKS,BLOB_LIBPP_HAL_WDEV_DELAY_DEBUG,ROM_REV0_PHY_SIFS_REG_INIT]; CONFIDENCE[instruction-exact-partial]. WDEVDELAY. On-chip hal_he_set_mac_delay performs separate RMWs for WDEV_RXCCK_DELAY, bits 9:0 and bits 30:21; complete phy_sifs_reg_init writes 0x3b8 and 0xf0 to the first two fields.</description>
          <addressOffset>0x80c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>LOW_DELAY_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field><field><name>RX_CCK_DELAY</name><description>SOURCE[BLOB_LIBPP_HAL_WDEV_DELAY_DEBUG]; CONFIDENCE[instruction-exact].</description><bitOffset>10</bitOffset><bitWidth>11</bitWidth></field><field><name>HIGH_DELAY_UNKNOWN</name><bitOffset>21</bitOffset><bitWidth>10</bitWidth></field></fields>
        </register>
