ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TXRX_SUFFIX</name>
      <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_SUFFIX]; CONFIDENCE[instruction-exact-partial]. Nine direct fresh-read RMW edges after the three external HE callbacks in complete mac_txrx_init.</description>
      <baseAddress>0x20104308</baseAddress>
      <registers>
        <register>
          <name>AUX_ENABLE</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_SUFFIX,BLOB_LIBPP_DEBUG_STATISTICS_CONTROL]; CONFIDENCE[instruction-exact-partial]. The TX/RX init suffix sets bit 1. Complete dbg_clr_hw_count reaches esp_test_clr_hw_statistics, which independently pulses bit 0 high then low while the matching core statistics-clear arm is asserted.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>HARDWARE_STATISTICS_CLEAR_PULSE</name><description>Set and then cleared by complete esp_test_clr_hw_statistics.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>ENABLE_UNKNOWN</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>DEFAULT_IMAGE_A</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_SUFFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete suffix replaces the low twelve bits with 0x0f0.</description>
          <addressOffset>0x918</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>LOW_IMAGE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields>
        </register>
        <register>
          <name>DEFAULT_IMAGE_B</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_SUFFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete suffix replaces the low twelve bits with 0x0f0.</description>
          <addressOffset>0x91c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>LOW_IMAGE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields>
        </register>
        <register>
          <name>GATE_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_SUFFIX]; CONFIDENCE[instruction-exact]. Complete suffix sets bits 30:16 together, then sets bit 31 through a separate fresh-read edge.</description>
          <addressOffset>0x958</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>LOW_GATE_GROUP_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>15</bitWidth></field><field><name>HIGH_GATE_UNKNOWN</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>FIELD_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_SUFFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete suffix replaces bits 7:4 with four.</description>
          <addressOffset>0x9a0</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>FIELD_UNKNOWN</name><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_CSI_CONTROL</name>
      <description>SOURCE[BLOB_LIBPP_MAC_LAST_RXBUF_INIT,BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact-partial]. Multifunction receive/CSI word. Complete mac_last_rxbuf_init sets bit 27; complete hal_init later replaces its low and second bytes through separate RMWs.</description>
      <baseAddress>0x20104098</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_MAC_LAST_RXBUF_INIT,BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact-partial]. Complete mac_last_rxbuf_init sets bit 27 after publishing all six table entries and both control groups. Complete hal_init later replaces byte zero with one, then byte one with one through a second fresh-read edge.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>HAL_INIT_LOW_BYTE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_init replaces bits 7:0 with one.</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>HAL_INIT_SECOND_BYTE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_init replaces bits 15:8 with one through a separate RMW.</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>

            <field><name>LAST_RX_BUFFER_ENABLE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_MAC_LAST_RXBUF_INIT]; CONFIDENCE[instruction-exact]. Final set edge of mac_last_rxbuf_init; its narrower interaction with CSI is unknown.</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>

          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_LAST_RX_BUFFER</name>
      <description>SOURCE[BLOB_LIBPP_MAC_LAST_RXBUF_INIT]; CONFIDENCE[instruction-exact-partial]. Six three-word last-RX-buffer entries and their shared two-edge enable control, recovered from the complete mac_last_rxbuf_init leaf.</description>
      <baseAddress>0x20104120</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_MAC_LAST_RXBUF_INIT]; CONFIDENCE[instruction-exact-partial]. Complete leaf sets bits 13:8 first, then sets bits 6:1 through a second fresh-read RMW.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>LOW_ENABLE_GROUP_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_MAC_LAST_RXBUF_INIT]; CONFIDENCE[instruction-exact]. All six bits are set by the second control RMW.</description><bitOffset>1</bitOffset><bitWidth>6</bitWidth></field>

            <field><name>HIGH_ENABLE_GROUP_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_MAC_LAST_RXBUF_INIT]; CONFIDENCE[instruction-exact]. All six bits are set by the first control RMW.</description><bitOffset>8</bitOffset><bitWidth>6</bitWidth></field>

          </fields>
        </register>
