ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
        <register><dim>6</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-5</dimIndex>
          <name>ENTRY_CONTROL%s</name>
          <description>SOURCE[BLOB_LIBPP_MAC_LAST_RXBUF_INIT]; CONFIDENCE[instruction-exact-partial]. First full-word image for each of six entries.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>IMAGE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register><dim>6</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-5</dimIndex>
          <name>ENTRY_PARAMETER_A%s</name>
          <description>SOURCE[BLOB_LIBPP_MAC_LAST_RXBUF_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Second full-word image for each of six entries.</description>
          <addressOffset>0x20</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>IMAGE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register><dim>6</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-5</dimIndex>
          <name>ENTRY_PARAMETER_B%s</name>
          <description>SOURCE[BLOB_LIBPP_MAC_LAST_RXBUF_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Third full-word image for each of six entries.</description>
          <addressOffset>0x3c</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>IMAGE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_CORE_ENABLE</name>
      <description>
        SOURCE[BLOB_LIBPP_HAL_ENABLE_MAC];
        CONFIDENCE[instruction-exact-partial].
        Shared MAC enable gate recovered from the complete hal_enable_mac and
        hal_disable_mac leaves. The four individual disable-bit meanings are
        not independently known.
      </description>
      <baseAddress>0x20104c00</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_ENABLE_MAC,BLOB_LIBPP_DEBUG_STATISTICS_CONTROL]; CONFIDENCE[instruction-exact-partial]. Complete hal_enable_mac clears bits 7:4 in one fresh-read RMW before publishing its interrupt-mask argument; complete hal_disable_mac sets the same four bits. Complete esp_test_clr_hw_statistics independently asserts bit 16 around the separate 0x20104308 bit-zero clear pulse, then clears bit 16.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>MAC_DISABLE_GATES_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ENABLE_MAC]; CONFIDENCE[instruction-exact]. Zero is the complete hal_enable_mac image and all ones is the complete hal_disable_mac image; individual gate identities remain unknown.</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field>

            <field><name>HARDWARE_STATISTICS_CLEAR_ARM</name><description>Set before and cleared after the 0x20104308 clear pulse by complete esp_test_clr_hw_statistics.</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>

          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_INTERRUPT</name>
      <description>
        SOURCE[BLOB_LIBPP_HAL_MAC_INTERRUPT_GET_EVENT,
        BLOB_LIBPP_HAL_MAC_INTERRUPT_CLR_EVENT,
        BLOB_LIBPP_WDEV_PROCESS_FIQ,
        BLOB_LIBPP_HAL_ENABLE_MAC,
        BLOB_LIBPP_HAL_INIT_TAIL];
        CONFIDENCE[instruction-exact].
        Wi-Fi MAC interrupt mask, masked status and write-to-clear aperture.
        The two complete hal_mac leaves independently prove the status and
        clear addresses. The recovered common FIQ and cold initializer prove
        the event-bit mapping and mask transaction used by the open ISR.
      </description>
      <baseAddress>0x20104c40</baseAddress>
      <registers>
        <register>
          <name>ENABLE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_ENABLE_MAC,BLOB_LIBPP_WDEV_PROCESS_FIQ,BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact]. Complete hal_init first publishes 0x19a879e0 here before its remaining tail. Complete hal_enable_mac independently publishes its argument after clearing the shared MAC disable gates. The common FIQ samples it with each interrupt status snapshot.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>EVENT_MASK</name><description>SOURCE[BLOB_LIBPP_HAL_ENABLE_MAC,BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact]. One enable bit per MAC event; complete hal_init stores 0x19a879e0 and complete hal_enable_mac stores its full argument here. Event identities are documented on STATUS.</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>RAW</name>
          <description>SOURCE[BLOB_LIBPP_ISR_REGISTER_DUMP]; CONFIDENCE[instruction-exact]. Unmasked WDEV interrupt snapshot read and named by complete print_isr_regs. No write behavior is inferred from this diagnostic reader.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>EVENTS</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_INTERRUPT_GET_EVENT,BLOB_LIBPP_WDEV_PROCESS_FIQ]; CONFIDENCE[instruction-exact]. Masked MAC event snapshot read by the complete hal_mac_interrupt_get_event leaf.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>RX_ASSOCIATED_AUXILIARY_5</name><description>SOURCE[BLOB_LIBPP_WDEV_PROCESS_FIQ,BLOB_LIBPP_HAL_INIT_TAIL,HIL_OPEN_MAC_IRQ_STATUS_CLASSIFICATION_2026_08_03]; CONFIDENCE[instruction-exact-semantics-unknown]. Enabled by the cold MAC mask 0x19a879e0 and observed asserted with RX_SUCCESS throughout sustained HE20 receive traffic. Complete wDev_ProcessFiq acknowledges this bit as part of the full STATUS image but does not dispatch independent work for it. Its hardware meaning and independent transition rules remain unknown; software must not treat it as RX ownership or work multiplicity.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TX_COMPLETE</name><description>SOURCE[BLOB_LIBPP_WDEV_PROCESS_FIQ]; CONFIDENCE[instruction-exact]. At least one hardware TX queue completed.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BSS_COLOR_COLLISION</name><description>SOURCE[BLOB_LIBPP_WDEV_PROCESS_FIQ,BLOB_LIBPP_HAL_MAC_COLOR_COLLISION_ISR]; CONFIDENCE[instruction-exact]. HE BSS-color collision event.</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>WATCHDOG</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_INTERRUPT_CLR_WATCHDOG]; CONFIDENCE[instruction-exact]. MAC watchdog event cleared by the complete dedicated leaf.</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RX_SUCCESS</name><description>SOURCE[BLOB_LIBPP_WDEV_PROCESS_FIQ]; CONFIDENCE[instruction-exact]. Successfully received frame is ready for the RX completion path.</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TX_TIMEOUT</name><description>SOURCE[BLOB_LIBPP_WDEV_PROCESS_FIQ]; CONFIDENCE[instruction-exact]. Hardware TX queue timeout/abort event.</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RX_ASSOCIATED_AUXILIARY_24</name><description>SOURCE[BLOB_LIBPP_WDEV_PROCESS_FIQ,BLOB_LIBPP_HAL_INIT_TAIL,HIL_OPEN_MAC_IRQ_STATUS_CLASSIFICATION_2026_08_03]; CONFIDENCE[instruction-exact-semantics-unknown]. Enabled by the cold MAC mask 0x19a879e0 and observed asserted with RX_SUCCESS throughout sustained HE20 receive traffic. Complete wDev_ProcessFiq acknowledges this bit as part of the full STATUS image but does not dispatch independent work for it. Its hardware meaning and independent transition rules remain unknown; software must not treat it as RX ownership or work multiplicity.</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>CLEAR</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_INTERRUPT_CLR_EVENT,BLOB_LIBPP_WDEV_PROCESS_FIQ]; CONFIDENCE[instruction-exact]. Full event snapshot written by the complete clear leaf to acknowledge pending MAC events.</description>
          <addressOffset>0x0c</addressOffset><size>32</size><access>write-only</access><modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field><name>EVENTS</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_INTERRUPT_CLR_EVENT]; CONFIDENCE[instruction-exact]. Ones acknowledge the corresponding event bits.</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
          </fields>
        </register>
