ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
        <register>
          <name>TX_QUEUE_INFORMATION_Q3</name>
          <description>SOURCE[BLOB_LIBPP_DBG_DUMP_TXQ_TXINFO]; CONFIDENCE[instruction-exact]. WDEVTXQ_TXINFO for reverse-addressed hardware queue 3.</description>
          <addressOffset>0x13b0</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>13</bitWidth></field><field><name>TRIGGER_BASED_PACKET_COUNT</name><bitOffset>13</bitOffset><bitWidth>7</bitWidth></field><field><name>LAST_TX_WAS_TRIGGER_BASED</name><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q3</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,MIGRATION_TX_AMPDU]; CONFIDENCE[instruction-exact-hil-qualified]. High 32 acknowledgement bits for completed hardware queue 3.</description>
          <addressOffset>0x13b4</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q3</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,MIGRATION_TX_AMPDU]; CONFIDENCE[instruction-exact-hil-qualified]. Low 32 acknowledgement bits for completed hardware queue 3.</description>
          <addressOffset>0x13b8</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q3</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,MIGRATION_TX_AMPDU]; CONFIDENCE[instruction-exact-hil-qualified]. Control bits 19:16 and starting sequence bits 15:4 for completed hardware queue 3.</description>
          <addressOffset>0x13bc</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>STARTING_SEQUENCE</name><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field><field><name>TID_OR_CONTROL</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q3</name>
          <description>SOURCE[BLOB_LIBPP_DBG_READ_RX_BA,BLOB_LIBPP_DBG_DUMP_TXQ_TXINFO]; CONFIDENCE[instruction-exact]. WDEVTXQBA_TAHI; high two transmitter-address bytes plus ACK/BlockAck result state.</description>
          <addressOffset>0x13c0</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>ADDRESS_BYTES_4_5</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>ACK_TID</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>ACK_RECEIVED</name><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>BLOCK_ACK_RECEIVED</name><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>22</bitOffset><bitWidth>10</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q3</name>
          <description>SOURCE[BLOB_LIBPP_DBG_READ_RX_BA]; CONFIDENCE[instruction-exact]. WDEVTXQBA_TALO; low four transmitter-address bytes.</description>
          <addressOffset>0x13c4</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q2</name>
          <description>SOURCE[BLOB_LIBPP_DBG_DUMP_TXQ_TXINFO]; CONFIDENCE[instruction-exact]. WDEVTXQ_TXINFO for reverse-addressed hardware queue 2.</description>
          <addressOffset>0x142c</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>13</bitWidth></field><field><name>TRIGGER_BASED_PACKET_COUNT</name><bitOffset>13</bitOffset><bitWidth>7</bitWidth></field><field><name>LAST_TX_WAS_TRIGGER_BASED</name><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q2</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,MIGRATION_TX_AMPDU]; CONFIDENCE[instruction-exact-hil-qualified]. High 32 acknowledgement bits for completed hardware queue 2.</description>
          <addressOffset>0x1430</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q2</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,MIGRATION_TX_AMPDU]; CONFIDENCE[instruction-exact-hil-qualified]. Low 32 acknowledgement bits for completed hardware queue 2.</description>
          <addressOffset>0x1434</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q2</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,MIGRATION_TX_AMPDU]; CONFIDENCE[instruction-exact-hil-qualified]. Control bits 19:16 and starting sequence bits 15:4 for completed hardware queue 2.</description>
          <addressOffset>0x1438</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>STARTING_SEQUENCE</name><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field><field><name>TID_OR_CONTROL</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q2</name>
          <description>SOURCE[BLOB_LIBPP_DBG_READ_RX_BA,BLOB_LIBPP_DBG_DUMP_TXQ_TXINFO]; CONFIDENCE[instruction-exact]. WDEVTXQBA_TAHI; high two transmitter-address bytes plus ACK/BlockAck result state.</description>
          <addressOffset>0x143c</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>ADDRESS_BYTES_4_5</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>ACK_TID</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>ACK_RECEIVED</name><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>BLOCK_ACK_RECEIVED</name><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>22</bitOffset><bitWidth>10</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q2</name>
          <description>SOURCE[BLOB_LIBPP_DBG_READ_RX_BA]; CONFIDENCE[instruction-exact]. WDEVTXQBA_TALO; low four transmitter-address bytes.</description>
          <addressOffset>0x1440</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q1</name>
          <description>SOURCE[BLOB_LIBPP_DBG_DUMP_TXQ_TXINFO]; CONFIDENCE[instruction-exact]. WDEVTXQ_TXINFO for reverse-addressed hardware queue 1.</description>
          <addressOffset>0x14a8</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>13</bitWidth></field><field><name>TRIGGER_BASED_PACKET_COUNT</name><bitOffset>13</bitOffset><bitWidth>7</bitWidth></field><field><name>LAST_TX_WAS_TRIGGER_BASED</name><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q1</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,MIGRATION_TX_AMPDU]; CONFIDENCE[instruction-exact-hil-qualified]. High 32 acknowledgement bits for completed hardware queue 1.</description>
          <addressOffset>0x14ac</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q1</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,MIGRATION_TX_AMPDU]; CONFIDENCE[instruction-exact-hil-qualified]. Low 32 acknowledgement bits for completed hardware queue 1.</description>
          <addressOffset>0x14b0</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q1</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,MIGRATION_TX_AMPDU]; CONFIDENCE[instruction-exact-hil-qualified]. Control bits 19:16 and starting sequence bits 15:4 for completed hardware queue 1.</description>
          <addressOffset>0x14b4</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>STARTING_SEQUENCE</name><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field><field><name>TID_OR_CONTROL</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q1</name>
          <description>SOURCE[BLOB_LIBPP_DBG_READ_RX_BA,BLOB_LIBPP_DBG_DUMP_TXQ_TXINFO]; CONFIDENCE[instruction-exact]. WDEVTXQBA_TAHI; high two transmitter-address bytes plus ACK/BlockAck result state.</description>
          <addressOffset>0x14b8</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>ADDRESS_BYTES_4_5</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>ACK_TID</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>ACK_RECEIVED</name><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>BLOCK_ACK_RECEIVED</name><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>22</bitOffset><bitWidth>10</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q1</name>
          <description>SOURCE[BLOB_LIBPP_DBG_READ_RX_BA]; CONFIDENCE[instruction-exact]. WDEVTXQBA_TALO; low four transmitter-address bytes.</description>
          <addressOffset>0x14bc</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_QUEUE_INFORMATION_Q0</name>
          <description>SOURCE[BLOB_LIBPP_DBG_DUMP_TXQ_TXINFO]; CONFIDENCE[instruction-exact]. WDEVTXQ_TXINFO for reverse-addressed hardware queue 0.</description>
          <addressOffset>0x1524</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>13</bitWidth></field><field><name>TRIGGER_BASED_PACKET_COUNT</name><bitOffset>13</bitOffset><bitWidth>7</bitWidth></field><field><name>LAST_TX_WAS_TRIGGER_BASED</name><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_HIGH_Q0</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29,HIL_OPEN_HT_AMPDU_32_RETRY_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. High 32 acknowledgement bits for completed hardware queue 0, sampled before acknowledging the completion edge.</description>
          <addressOffset>0x1528</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_BLOCK_ACK_BITMAP_LOW_Q0</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29,HIL_OPEN_HT_AMPDU_32_RETRY_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Low 32 acknowledgement bits for completed hardware queue 0, sampled before acknowledging the completion edge.</description>
          <addressOffset>0x152c</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>TX_BLOCK_ACK_CONTROL_SEQUENCE_Q0</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK,HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29,HIL_OPEN_HT_AMPDU_32_RETRY_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Control bits 19:16 and starting sequence bits 15:4 for completed hardware queue 0, sampled before acknowledging the completion edge.</description>
          <addressOffset>0x1530</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>STARTING_SEQUENCE</name><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field>
            <field><name>TID_OR_CONTROL</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_HIGH_Q0</name>
          <description>SOURCE[BLOB_LIBPP_DBG_READ_RX_BA,BLOB_LIBPP_DBG_DUMP_TXQ_TXINFO,HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. WDEVTXQBA_TAHI; high two transmitter-address bytes plus ACK/BlockAck result state for completed queue 0.</description>
          <addressOffset>0x1534</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>ADDRESS_BYTES_4_5</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>ACK_TID</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>ACK_RECEIVED</name><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>BLOCK_ACK_RECEIVED</name><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>22</bitOffset><bitWidth>10</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_BLOCK_ACK_TRANSMITTER_ADDRESS_LOW_Q0</name>
          <description>SOURCE[BLOB_LIBPP_DBG_READ_RX_BA,HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. WDEVTXQBA_TALO; low four transmitter-address bytes for completed queue 0.</description>
          <addressOffset>0x1538</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register><dim>8</dim><dimIncrement>0x24</dimIncrement><dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Configuration word in one of eight reverse-addressed ordinary receive BlockAck banks. Physical array index zero is logical hardware index seven; complete hal_agreement_add_rx_ba writes logical index zero at 0x20104274 and subtracts 0x24 per index. Delete clears VALID, clears both load bitmaps, sets VALID once, then clears this complete word.</description>
          <addressOffset>0x0178</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>ENABLE</name><description>Complete add sets this bit in every installed ordinary receive BlockAck entry.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TID</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,BLOB_LIBNET80211_RX_BLOCK_ACK]; CONFIDENCE[instruction-exact]. Traffic identifier passed to complete hal_agreement_add_rx_ba without the extra staging path's index transform. The field is four bits wide, while complete ht_recv_action_ba_addba_request rejects values with bit three set and therefore admits TIDs zero through seven.</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>WRITE</name><description>Complete add sets this bit together with ENABLE and VALID when publishing the entry configuration.</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>VALID</name><description>Marks an installed entry. Complete delete clears and reasserts it around bitmap clearing before zeroing the entry.</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register><dim>8</dim><dimIncrement>0x24</dimIncrement><dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_PEER_TAIL_AND_POLICY</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,BLOB_LIBNET80211_RX_BLOCK_ACK,HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Peer MAC bytes four and five, interface number and receive reorder-window size in one reverse-addressed ordinary receive BlockAck bank. Complete vendor ampdu_rx_start limits the protocol agreement by the peer request and configured receive window; its ordinary hardware-activation branch independently passes the constant 64 to ic_add_rx_ba. Complete hal_agreement_add_rx_ba then stores that value in WINDOW.</description>
          <addressOffset>0x017c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>PEER_ADDRESS_TAIL</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>INTERFACE</name><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>WINDOW</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,BLOB_LIBNET80211_RX_BLOCK_ACK]; CONFIDENCE[instruction-exact]. Seven-bit hardware receive BlockAck window. The normal vendor ordinary-STA activation path publishes 64.</description><bitOffset>18</bitOffset><bitWidth>7</bitWidth></field>
          </fields>
        </register>
        <register><dim>8</dim><dimIncrement>0x24</dimIncrement><dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_PEER_HEAD</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Peer MAC bytes zero through three in little-endian order in one reverse-addressed ordinary receive BlockAck bank.</description>
          <addressOffset>0x0180</addressOffset><size>32</size><access>read-write</access>
        </register>
        <register><dim>8</dim><dimIncrement>0x24</dimIncrement><dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_CURRENT_SEQUENCE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Hardware-maintained twelve-bit receive/reorder sequence state. Complete hal_ba_session_store snapshots this word and complete hal_ba_session_restore copies its saved low twelve bits into START_SEQUENCE_LOAD.</description>
          <addressOffset>0x0184</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>SEQUENCE</name><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields>
        </register>
        <register><dim>8</dim><dimIncrement>0x24</dimIncrement><dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_START_SEQUENCE_LOAD</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Twelve-bit starting sequence written by complete add/reset/restore leaves. This is the software load word paired with the adjacent hardware-maintained CURRENT_SEQUENCE word.</description>
          <addressOffset>0x0188</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>SEQUENCE</name><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields>
        </register>
        <register><dim>8</dim><dimIncrement>0x24</dimIncrement><dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_BITMAP_LOW_STATUS</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Hardware-maintained low reorder bitmap. Complete hal_ba_session_store snapshots this word and restore copies it into BITMAP_LOW_LOAD while VALID is clear.</description>
          <addressOffset>0x018c</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register><dim>8</dim><dimIncrement>0x24</dimIncrement><dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_BITMAP_LOW_LOAD</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Software load word for the low reorder bitmap. Complete add and delete clear it; complete session restore writes the saved low status bitmap here while VALID is clear.</description>
          <addressOffset>0x0190</addressOffset><size>32</size><access>read-write</access>
        </register>
        <register><dim>8</dim><dimIncrement>0x24</dimIncrement><dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_BITMAP_HIGH_STATUS</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Hardware-maintained high reorder bitmap. Complete hal_ba_session_store snapshots this word and restore copies it into BITMAP_HIGH_LOAD while VALID is clear.</description>
          <addressOffset>0x0194</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register><dim>8</dim><dimIncrement>0x24</dimIncrement><dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>RX_BLOCK_ACK_ENTRY%s_BITMAP_HIGH_LOAD</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Software load word for the high reorder bitmap. Complete add and delete clear it; complete session restore writes the saved high status bitmap here while VALID is clear.</description>
          <addressOffset>0x0198</addressOffset><size>32</size><access>read-write</access>
        </register>
        <register>
          <name>RX_BLOCK_ACK_AGREEMENT_UPDATE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK,HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Ordinary add/reset sets one of bits zero through seven for the corresponding direct bank. The independent extra-SoftAP staging path pulses bit eight to commit and uses bit nine to latch a selected entry for readback.</description>
          <addressOffset>0x0298</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>ORDINARY_ENTRY_UPDATE</name><description>One update bit per reverse-addressed ordinary receive BlockAck bank. Complete add/reset performs a fresh-read OR with one shifted by the logical hardware index.</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>EXTRA_SOFTAP_COMMIT</name><description>Complete extra-SoftAP add/reset/delete pulses this bit high then low after filling the shared staging words.</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>EXTRA_SOFTAP_READBACK_LATCH</name><description>Complete extra-SoftAP diagnostics, reset and delete set this bit while reading the entry selected in the staging control and clear it afterwards.</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
