ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/wifi-mac.xml
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK]; CONFIDENCE[instruction-exact]. Shared staging and readback-control word used only by complete hal_agreement_*_extra_softap_rx_ba leaves. Ordinary STA/AP receive BlockAck agreements use the eight direct banks at 0x20104178..0x20104294 instead.</description>
          <addressOffset>0x0ea4</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>ENABLE</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>INDEX</name><bitOffset>5</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>TID</name><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>WRITE</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>VALID</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_PEER_TAIL_AND_POLICY</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK]; CONFIDENCE[instruction-exact]. Shared extra-SoftAP staging word carrying peer MAC bytes four and five, interface and reorder-window size.</description>
          <addressOffset>0x0ea8</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>PEER_ADDRESS_TAIL</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>INTERFACE</name><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>WINDOW</name><bitOffset>18</bitOffset><bitWidth>7</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_PEER_HEAD</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK]; CONFIDENCE[instruction-exact]. Shared extra-SoftAP staging word carrying peer MAC bytes zero through three in little-endian order.</description>
          <addressOffset>0x0eac</addressOffset><size>32</size><access>read-write</access>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_START_SEQUENCE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK]; CONFIDENCE[instruction-exact]. Shared extra-SoftAP staging word carrying the twelve-bit starting sequence.</description>
          <addressOffset>0x0eb0</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>SEQUENCE</name><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_BITMAP_LOW</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK]; CONFIDENCE[instruction-exact]. Shared extra-SoftAP low receive/reorder bitmap staging word, cleared when installing or removing an entry.</description>
          <addressOffset>0x0eb4</addressOffset><size>32</size><access>read-write</access>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_BITMAP_HIGH</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK]; CONFIDENCE[instruction-exact]. Shared extra-SoftAP high receive/reorder bitmap staging word, cleared when installing or removing an entry.</description>
          <addressOffset>0x0eb8</addressOffset><size>32</size><access>read-write</access>
        </register>
      </registers>
    </peripheral>
</openEspRadioPeripheralFragment>
